[Killed] ConditionalExpression
src/codec.ts:193:7
  * this validator MUST be called before zstdDecompress / decompressUsingDict.
  */
 function validateZstdFrame(bytes: Uint8Array, maxDecompressed: number): void {
-  if (bytes.length < 6) {
+  if (true) {
     throw new WireCodecError(
       "ZSTD_DECODE_FAILED",
killedBy: wire-codec — zstd encodes with cbor+zstd, decodes back
statusReason: wire-codec.decode: zstd frame truncated (header < 6 bytes)

[Killed] EqualityOperator
src/codec.ts:193:7
  * this validator MUST be called before zstdDecompress / decompressUsingDict.
  */
 function validateZstdFrame(bytes: Uint8Array, maxDecompressed: number): void {
-  if (bytes.length < 6) {
+  if (bytes.length >= 6) {
     throw new WireCodecError(
       "ZSTD_DECODE_FAILED",
killedBy: decode — ZSTD_DECODE_FAILED (malformed zstd payload) throws WireCodecError ZSTD_DECODE_FAILED for malformed zstd frame after 0xC6
statusReason: expected 'ZSTD_NOT_INITIALIZED' to be 'ZSTD_DECODE_FAILED' // Object.is equality

[NoCoverage] StringLiteral
src/codec.ts:196:7
   if (bytes.length < 6) {
     throw new WireCodecError(
       "ZSTD_DECODE_FAILED",
-      "wire-codec.decode: zstd frame truncated (header < 6 bytes)",
+      "",
     );
   }

[Killed] EqualityOperator
src/codec.ts:199:19
       "wire-codec.decode: zstd frame truncated (header < 6 bytes)",
     );
   }
-  for (let i = 0; i < 4; i++) {
+  for (let i = 0; i >= 4; i++) {
     if (bytes[i] !== ZSTD_MAGIC_BYTES[i]) {
       throw new WireCodecError(
killedBy: decode — ZSTD_DECODE_FAILED (malformed zstd payload) throws WireCodecError ZSTD_DECODE_FAILED for malformed zstd frame after 0xC6
statusReason: expected 'ZSTD_NOT_INITIALIZED' to be 'ZSTD_DECODE_FAILED' // Object.is equality

[Killed] EqualityOperator
src/codec.ts:199:19
       "wire-codec.decode: zstd frame truncated (header < 6 bytes)",
     );
   }
-  for (let i = 0; i < 4; i++) {
+  for (let i = 0; i <= 4; i++) {
     if (bytes[i] !== ZSTD_MAGIC_BYTES[i]) {
       throw new WireCodecError(
killedBy: decode — ZSTD_DECODE_FAILED (malformed zstd payload) throws WireCodecError ZSTD_DECODE_FAILED for malformed zstd frame after 0xC6
statusReason: expected 'ZSTD_NOT_INITIALIZED' to be 'ZSTD_DECODE_FAILED' // Object.is equality

[Killed] EqualityOperator
src/codec.ts:200:9
     );
   }
   for (let i = 0; i < 4; i++) {
-    if (bytes[i] !== ZSTD_MAGIC_BYTES[i]) {
+    if (bytes[i] === ZSTD_MAGIC_BYTES[i]) {
       throw new WireCodecError(
         "ZSTD_DECODE_FAILED",
killedBy: decode — ZSTD_DECODE_FAILED (malformed zstd payload) throws WireCodecError ZSTD_DECODE_FAILED for malformed zstd frame after 0xC6
statusReason: expected 'ZSTD_NOT_INITIALIZED' to be 'ZSTD_DECODE_FAILED' // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:200:9
     );
   }
   for (let i = 0; i < 4; i++) {
-    if (bytes[i] !== ZSTD_MAGIC_BYTES[i]) {
+    if (false) {
       throw new WireCodecError(
         "ZSTD_DECODE_FAILED",
killedBy: decode — ZSTD_DECODE_FAILED (malformed zstd payload) throws WireCodecError ZSTD_DECODE_FAILED for malformed zstd frame after 0xC6
statusReason: expected 'ZSTD_NOT_INITIALIZED' to be 'ZSTD_DECODE_FAILED' // Object.is equality

[Survived] EqualityOperator
src/codec.ts:215:7
 
   let cursor = 5;
   // Window_Descriptor: 1 byte iff Single_Segment=0.
-  if (singleSegment === 0) cursor += 1;
+  if (singleSegment !== 0) cursor += 1;
   // Dictionary_ID: 0/1/2/4 bytes per dictIdFlag.
   const dictIdBytes = dictIdFlag === 0 ? 0 : dictIdFlag === 1 ? 1 : dictIdFlag === 2 ? 2 : 4;

[Survived] ConditionalExpression
src/codec.ts:215:7
 
   let cursor = 5;
   // Window_Descriptor: 1 byte iff Single_Segment=0.
-  if (singleSegment === 0) cursor += 1;
+  if (false) cursor += 1;
   // Dictionary_ID: 0/1/2/4 bytes per dictIdFlag.
   const dictIdBytes = dictIdFlag === 0 ? 0 : dictIdFlag === 1 ? 1 : dictIdFlag === 2 ? 2 : 4;

[Killed] ConditionalExpression
src/codec.ts:217:23
   // Window_Descriptor: 1 byte iff Single_Segment=0.
   if (singleSegment === 0) cursor += 1;
   // Dictionary_ID: 0/1/2/4 bytes per dictIdFlag.
-  const dictIdBytes = dictIdFlag === 0 ? 0 : dictIdFlag === 1 ? 1 : dictIdFlag === 2 ? 2 : 4;
+  const dictIdBytes = false ? 0 : dictIdFlag === 1 ? 1 : dictIdFlag === 2 ? 2 : 4;
   cursor += dictIdBytes;
 
killedBy: Phase 2.E.B — zstd dict negotiation + encoder rejects a tiny zstd frame whose declared FCS exceeds the decompressed cap (bomb defense)
statusReason: expected [Function] to throw error matching /Frame_Content_Size .* exceeds cap/ but got 'wire-codec.decode: zstd frame truncat…'

[Survived] EqualityOperator
src/codec.ts:217:69
   // Window_Descriptor: 1 byte iff Single_Segment=0.
   if (singleSegment === 0) cursor += 1;
   // Dictionary_ID: 0/1/2/4 bytes per dictIdFlag.
-  const dictIdBytes = dictIdFlag === 0 ? 0 : dictIdFlag === 1 ? 1 : dictIdFlag === 2 ? 2 : 4;
+  const dictIdBytes = dictIdFlag === 0 ? 0 : dictIdFlag === 1 ? 1 : dictIdFlag !== 2 ? 2 : 4;
   cursor += dictIdBytes;
 

[Survived] AssignmentOperator
src/codec.ts:218:3
   if (singleSegment === 0) cursor += 1;
   // Dictionary_ID: 0/1/2/4 bytes per dictIdFlag.
   const dictIdBytes = dictIdFlag === 0 ? 0 : dictIdFlag === 1 ? 1 : dictIdFlag === 2 ? 2 : 4;
-  cursor += dictIdBytes;
+  cursor -= dictIdBytes;
 
   // Frame_Content_Size: 0/1/2/4/8 bytes.

[Killed] ConditionalExpression
src/codec.ts:227:7
   // fcsFlag=2 → 4 bytes.
   // fcsFlag=3 → 8 bytes.
   let fcsFieldSize: number;
-  if (fcsFlag === 0) fcsFieldSize = singleSegment === 1 ? 1 : 0;
+  if (true) fcsFieldSize = singleSegment === 1 ? 1 : 0;
   else if (fcsFlag === 1) fcsFieldSize = 2;
   else if (fcsFlag === 2) fcsFieldSize = 4;
killedBy: Phase 2.E.B — zstd dict negotiation + encoder rejects a tiny zstd frame whose declared FCS exceeds the decompressed cap (bomb defense)
statusReason: expected [Function] to throw error matching /Frame_Content_Size .* exceeds cap/ but got 'wire-codec.decode: zstd frame omits F…'

[Killed] ConditionalExpression
src/codec.ts:227:37
   // fcsFlag=2 → 4 bytes.
   // fcsFlag=3 → 8 bytes.
   let fcsFieldSize: number;
-  if (fcsFlag === 0) fcsFieldSize = singleSegment === 1 ? 1 : 0;
+  if (fcsFlag === 0) fcsFieldSize = false ? 1 : 0;
   else if (fcsFlag === 1) fcsFieldSize = 2;
   else if (fcsFlag === 2) fcsFieldSize = 4;
killedBy: wire-codec — zstd preserves Uint8Array through zstd round-trip
statusReason: wire-codec.decode: zstd frame omits Frame_Content_Size (streaming) — rejected

[Killed] ConditionalExpression
src/codec.ts:228:12
   // fcsFlag=3 → 8 bytes.
   let fcsFieldSize: number;
   if (fcsFlag === 0) fcsFieldSize = singleSegment === 1 ? 1 : 0;
-  else if (fcsFlag === 1) fcsFieldSize = 2;
+  else if (true) fcsFieldSize = 2;
   else if (fcsFlag === 2) fcsFieldSize = 4;
   else fcsFieldSize = 8;
killedBy: Phase 2.E.B — zstd dict negotiation + encoder rejects a tiny zstd frame whose declared FCS exceeds the decompressed cap (bomb defense)
statusReason: expected [Function] to throw error matching /Frame_Content_Size .* exceeds cap/ but got 'Failed to compress with code -72'

[Killed] ConditionalExpression
src/codec.ts:228:12
   // fcsFlag=3 → 8 bytes.
   let fcsFieldSize: number;
   if (fcsFlag === 0) fcsFieldSize = singleSegment === 1 ? 1 : 0;
-  else if (fcsFlag === 1) fcsFieldSize = 2;
+  else if (false) fcsFieldSize = 2;
   else if (fcsFlag === 2) fcsFieldSize = 4;
   else fcsFieldSize = 8;
killedBy: wire-codec — zstd encodes with cbor+zstd, decodes back
statusReason: wire-codec.decode: zstd Frame_Content_Size 13331785195010719749 exceeds cap 262144

[Killed] EqualityOperator
src/codec.ts:229:12
   let fcsFieldSize: number;
   if (fcsFlag === 0) fcsFieldSize = singleSegment === 1 ? 1 : 0;
   else if (fcsFlag === 1) fcsFieldSize = 2;
-  else if (fcsFlag === 2) fcsFieldSize = 4;
+  else if (fcsFlag !== 2) fcsFieldSize = 4;
   else fcsFieldSize = 8;
 
killedBy: Phase 2.E.B — zstd dict negotiation + encoder rejects a tiny zstd frame whose declared FCS exceeds the decompressed cap (bomb defense)
statusReason: expected [Function] to throw error matching /Frame_Content_Size .* exceeds cap/ but got 'Failed to compress with code -72'

[Killed] ConditionalExpression
src/codec.ts:229:12
   let fcsFieldSize: number;
   if (fcsFlag === 0) fcsFieldSize = singleSegment === 1 ? 1 : 0;
   else if (fcsFlag === 1) fcsFieldSize = 2;
-  else if (fcsFlag === 2) fcsFieldSize = 4;
+  else if (true) fcsFieldSize = 4;
   else fcsFieldSize = 8;
 
killedBy: Phase 2.E.B — zstd dict negotiation + encoder rejects a tiny zstd frame whose declared FCS exceeds the decompressed cap (bomb defense)
statusReason: expected [Function] to throw error matching /Frame_Content_Size .* exceeds cap/ but got 'Failed to compress with code -72'

[Killed] BlockStatement
src/codec.ts:232:27
   else if (fcsFlag === 2) fcsFieldSize = 4;
   else fcsFieldSize = 8;
 
-  if (fcsFieldSize === 0) {
-    throw new WireCodecError(
-      "ZSTD_DECODE_FAILED",
-      "wire-codec.decode: zstd frame omits Frame_Content_Size (streaming) — rejected",
-    );
-  }
+  if (fcsFieldSize === 0) {}
   if (cursor + fcsFieldSize > bytes.length) {
     throw new WireCodecError(
killedBy: Phase 2.E.B — zstd dict negotiation + encoder rejects a zstd frame that omits Frame_Content_Size (streaming, FCS absent)
statusReason: expected [Function] to throw error matching /omits Frame_Content_Size/ but got 'Cannot convert undefined to a BigInt'

[Killed] ConditionalExpression
src/codec.ts:232:7
   else if (fcsFlag === 2) fcsFieldSize = 4;
   else fcsFieldSize = 8;
 
-  if (fcsFieldSize === 0) {
+  if (true) {
     throw new WireCodecError(
       "ZSTD_DECODE_FAILED",
killedBy: wire-codec — zstd encodes with cbor+zstd, decodes back
statusReason: wire-codec.decode: zstd frame omits Frame_Content_Size (streaming) — rejected

[Killed] EqualityOperator
src/codec.ts:238:7
       "wire-codec.decode: zstd frame omits Frame_Content_Size (streaming) — rejected",
     );
   }
-  if (cursor + fcsFieldSize > bytes.length) {
+  if (cursor + fcsFieldSize <= bytes.length) {
     throw new WireCodecError(
       "ZSTD_DECODE_FAILED",
killedBy: wire-codec — zstd encodes with cbor+zstd, decodes back
statusReason: wire-codec.decode: zstd frame truncated before FCS

[Killed] ConditionalExpression
src/codec.ts:238:7
       "wire-codec.decode: zstd frame omits Frame_Content_Size (streaming) — rejected",
     );
   }
-  if (cursor + fcsFieldSize > bytes.length) {
+  if (true) {
     throw new WireCodecError(
       "ZSTD_DECODE_FAILED",
killedBy: wire-codec — zstd encodes with cbor+zstd, decodes back
statusReason: wire-codec.decode: zstd frame truncated before FCS

[NoCoverage] StringLiteral
src/codec.ts:241:7
   if (cursor + fcsFieldSize > bytes.length) {
     throw new WireCodecError(
       "ZSTD_DECODE_FAILED",
-      "wire-codec.decode: zstd frame truncated before FCS",
+      "",
     );
   }

[Killed] ConditionalExpression
src/codec.ts:248:7
   // Read FCS little-endian. Use BigInt for the 8-byte case; everything else
   // fits in a JS number (≤ 2^32-1).
   let fcs: number | bigint;
-  if (fcsFieldSize === 1) {
+  if (true) {
     fcs = bytes[cursor]!;
   } else if (fcsFieldSize === 2) {
killedBy: Phase 2.E.B — zstd dict negotiation + encoder rejects a tiny zstd frame whose declared FCS exceeds the decompressed cap (bomb defense)
statusReason: expected [Function] to throw error matching /Frame_Content_Size .* exceeds cap/ but got 'Failed to compress with code -72'

[Killed] ConditionalExpression
src/codec.ts:248:7
   // Read FCS little-endian. Use BigInt for the 8-byte case; everything else
   // fits in a JS number (≤ 2^32-1).
   let fcs: number | bigint;
-  if (fcsFieldSize === 1) {
+  if (false) {
     fcs = bytes[cursor]!;
   } else if (fcsFieldSize === 2) {
killedBy: wire-codec — zstd preserves Uint8Array through zstd round-trip
statusReason: wire-codec.decode: zstd Frame_Content_Size 144319662878967139 exceeds cap 262144

[Killed] ConditionalExpression
src/codec.ts:250:14
   let fcs: number | bigint;
   if (fcsFieldSize === 1) {
     fcs = bytes[cursor]!;
-  } else if (fcsFieldSize === 2) {
+  } else if (true) {
     fcs = (bytes[cursor]! | (bytes[cursor + 1]! << 8)) + 256; // RFC 8878: add 256
   } else if (fcsFieldSize === 4) {
killedBy: Phase 2.E.B — zstd dict negotiation + encoder rejects a tiny zstd frame whose declared FCS exceeds the decompressed cap (bomb defense)
statusReason: expected [Function] to throw error matching /Frame_Content_Size .* exceeds cap/ but got 'Failed to compress with code -72'

[Killed] ConditionalExpression
src/codec.ts:250:14
   let fcs: number | bigint;
   if (fcsFieldSize === 1) {
     fcs = bytes[cursor]!;
-  } else if (fcsFieldSize === 2) {
+  } else if (false) {
     fcs = (bytes[cursor]! | (bytes[cursor + 1]! << 8)) + 256; // RFC 8878: add 256
   } else if (fcsFieldSize === 4) {
killedBy: wire-codec — zstd encodes with cbor+zstd, decodes back
statusReason: wire-codec.decode: zstd Frame_Content_Size 13331785195010719749 exceeds cap 262144

[Survived] ArithmeticOperator
src/codec.ts:251:11
   if (fcsFieldSize === 1) {
     fcs = bytes[cursor]!;
   } else if (fcsFieldSize === 2) {
-    fcs = (bytes[cursor]! | (bytes[cursor + 1]! << 8)) + 256; // RFC 8878: add 256
+    fcs = (bytes[cursor]! | bytes[cursor + 1]! << 8) - 256; // RFC 8878: add 256
   } else if (fcsFieldSize === 4) {
     fcs =

[Survived] ArithmeticOperator
src/codec.ts:251:36
   if (fcsFieldSize === 1) {
     fcs = bytes[cursor]!;
   } else if (fcsFieldSize === 2) {
-    fcs = (bytes[cursor]! | (bytes[cursor + 1]! << 8)) + 256; // RFC 8878: add 256
+    fcs = (bytes[cursor]! | (bytes[cursor - 1]! << 8)) + 256; // RFC 8878: add 256
   } else if (fcsFieldSize === 4) {
     fcs =

[Killed] ConditionalExpression
src/codec.ts:252:14
     fcs = bytes[cursor]!;
   } else if (fcsFieldSize === 2) {
     fcs = (bytes[cursor]! | (bytes[cursor + 1]! << 8)) + 256; // RFC 8878: add 256
-  } else if (fcsFieldSize === 4) {
+  } else if (true) {
     fcs =
       bytes[cursor]! |
killedBy: Phase 2.E.B — zstd dict negotiation + encoder rejects a tiny zstd frame whose declared FCS exceeds the decompressed cap (bomb defense)
statusReason: expected [Function] to throw error matching /Frame_Content_Size .* exceeds cap/ but got 'Failed to compress with code -72'

[Killed] EqualityOperator
src/codec.ts:252:14
     fcs = bytes[cursor]!;
   } else if (fcsFieldSize === 2) {
     fcs = (bytes[cursor]! | (bytes[cursor + 1]! << 8)) + 256; // RFC 8878: add 256
-  } else if (fcsFieldSize === 4) {
+  } else if (fcsFieldSize !== 4) {
     fcs =
       bytes[cursor]! |
killedBy: Phase 2.E.B — zstd dict negotiation + encoder rejects a tiny zstd frame whose declared FCS exceeds the decompressed cap (bomb defense)
statusReason: expected [Function] to throw error matching /Frame_Content_Size .* exceeds cap/ but got 'Failed to compress with code -72'

[NoCoverage] ArithmeticOperator
src/codec.ts:255:14
   } else if (fcsFieldSize === 4) {
     fcs =
       bytes[cursor]! |
-      (bytes[cursor + 1]! << 8) |
+      (bytes[cursor - 1]! << 8) |
       (bytes[cursor + 2]! << 16) |
       // shifting into bit-31 produces a negative i32; use unsigned multiply.

[NoCoverage] ArithmeticOperator
src/codec.ts:256:14
     fcs =
       bytes[cursor]! |
       (bytes[cursor + 1]! << 8) |
-      (bytes[cursor + 2]! << 16) |
+      (bytes[cursor - 2]! << 16) |
       // shifting into bit-31 produces a negative i32; use unsigned multiply.
       bytes[cursor + 3]! * 0x01000000;

[NoCoverage] ArithmeticOperator
src/codec.ts:258:7
       (bytes[cursor + 1]! << 8) |
       (bytes[cursor + 2]! << 16) |
       // shifting into bit-31 produces a negative i32; use unsigned multiply.
-      bytes[cursor + 3]! * 0x01000000;
+      // shifting into bit-31 produces a negative i32; use unsigned multiply.
+bytes[cursor + 3]! / 0x01000000;
   } else {
     // 8 bytes: assemble LE BigInt.

[NoCoverage] ArithmeticOperator
src/codec.ts:258:13
       (bytes[cursor + 1]! << 8) |
       (bytes[cursor + 2]! << 16) |
       // shifting into bit-31 produces a negative i32; use unsigned multiply.
-      bytes[cursor + 3]! * 0x01000000;
+      bytes[cursor - 3]! * 0x01000000;
   } else {
     // 8 bytes: assemble LE BigInt.

[Killed] UpdateOperator
src/codec.ts:262:29
   } else {
     // 8 bytes: assemble LE BigInt.
     let v = 0n;
-    for (let i = 7; i >= 0; i--) v = (v << 8n) | BigInt(bytes[cursor + i]!);
+    for (let i = 7; i >= 0; i++) v = (v << 8n) | BigInt(bytes[cursor + i]!);
     fcs = v;
   }
killedBy: Phase 2.E.B — zstd dict negotiation + encoder rejects a tiny zstd frame whose declared FCS exceeds the decompressed cap (bomb defense)
statusReason: expected [Function] to throw error matching /Frame_Content_Size .* exceeds cap/ but got 'Cannot convert undefined to a BigInt'

[Killed] ConditionalExpression
src/codec.ts:262:21
   } else {
     // 8 bytes: assemble LE BigInt.
     let v = 0n;
-    for (let i = 7; i >= 0; i--) v = (v << 8n) | BigInt(bytes[cursor + i]!);
+    for (let i = 7; false; i--) v = (v << 8n) | BigInt(bytes[cursor + i]!);
     fcs = v;
   }
killedBy: Phase 2.E.B — zstd dict negotiation + encoder rejects a tiny zstd frame whose declared FCS exceeds the decompressed cap (bomb defense)
statusReason: expected [Function] to throw error matching /Frame_Content_Size .* exceeds cap/ but got 'Failed to compress with code -72'

[Survived] ConditionalExpression
src/codec.ts:267:18
   }
 
   const maxBig = BigInt(maxDecompressed);
-  const fcsBig = typeof fcs === "bigint" ? fcs : BigInt(fcs);
+  const fcsBig = true ? fcs : BigInt(fcs);
   if (fcsBig > maxBig) {
     throw new WireCodecError(

[Survived] ConditionalExpression
src/codec.ts:267:18
   }
 
   const maxBig = BigInt(maxDecompressed);
-  const fcsBig = typeof fcs === "bigint" ? fcs : BigInt(fcs);
+  const fcsBig = false ? fcs : BigInt(fcs);
   if (fcsBig > maxBig) {
     throw new WireCodecError(

[Killed] ConditionalExpression
src/codec.ts:268:7
 
   const maxBig = BigInt(maxDecompressed);
   const fcsBig = typeof fcs === "bigint" ? fcs : BigInt(fcs);
-  if (fcsBig > maxBig) {
+  if (true) {
     throw new WireCodecError(
       "ZSTD_DECODE_FAILED",
killedBy: wire-codec — zstd encodes with cbor+zstd, decodes back
statusReason: wire-codec.decode: zstd Frame_Content_Size 261 exceeds cap 262144

[Killed] ConditionalExpression
src/codec.ts:268:7
 
   const maxBig = BigInt(maxDecompressed);
   const fcsBig = typeof fcs === "bigint" ? fcs : BigInt(fcs);
-  if (fcsBig > maxBig) {
+  if (false) {
     throw new WireCodecError(
       "ZSTD_DECODE_FAILED",
killedBy: Phase 2.E.B — zstd dict negotiation + encoder rejects a tiny zstd frame whose declared FCS exceeds the decompressed cap (bomb defense)
statusReason: expected [Function] to throw error matching /Frame_Content_Size .* exceeds cap/ but got 'Failed to compress with code -72'

[Killed] ConditionalExpression
src/codec.ts:313:7
 }
 
 export function encode(value: unknown, opts: EncodeOpts = {}): WireBytes {
-  if (opts.zstd && !opts.cbor) {
+  if (false) {
     throw new WireCodecError(
       "ENCODE_ZSTD_REQUIRES_CBOR",
killedBy: encode — ENCODE_ZSTD_REQUIRES_CBOR throws WireCodecError with code ENCODE_ZSTD_REQUIRES_CBOR when zstd=true without cbor=true
statusReason: expected 'ZSTD_NOT_INITIALIZED' to be 'ENCODE_ZSTD_REQUIRES_CBOR' // Object.is equality

[Killed] BlockStatement
src/codec.ts:313:32
 }
 
 export function encode(value: unknown, opts: EncodeOpts = {}): WireBytes {
-  if (opts.zstd && !opts.cbor) {
-    throw new WireCodecError(
-      "ENCODE_ZSTD_REQUIRES_CBOR",
-      "wire-codec.encode: zstd requires cbor=true",
-    );
-  }
+  if (opts.zstd && !opts.cbor) {}
   if (opts.zstd) {
     if (!zstdReady) {
killedBy: encode — ENCODE_ZSTD_REQUIRES_CBOR throws WireCodecError with code ENCODE_ZSTD_REQUIRES_CBOR when zstd=true without cbor=true
statusReason: expected 'ZSTD_NOT_INITIALIZED' to be 'ENCODE_ZSTD_REQUIRES_CBOR' // Object.is equality

[Killed] StringLiteral
src/codec.ts:316:7
   if (opts.zstd && !opts.cbor) {
     throw new WireCodecError(
       "ENCODE_ZSTD_REQUIRES_CBOR",
-      "wire-codec.encode: zstd requires cbor=true",
+      "",
     );
   }
killedBy: wire-codec — zstd throws if zstd without cbor
statusReason: expected [Function] to throw error matching /zstd requires cbor/ but got ''

[Killed] ConditionalExpression
src/codec.ts:319:7
       "wire-codec.encode: zstd requires cbor=true",
     );
   }
-  if (opts.zstd) {
+  if (true) {
     if (!zstdReady) {
       throw new WireCodecError(
killedBy: wire-codec JSON-encodes by default, decodes back
statusReason: expected 198 to be 123 // Object.is equality

[Killed] BooleanLiteral
src/codec.ts:320:9
     );
   }
   if (opts.zstd) {
-    if (!zstdReady) {
+    if (zstdReady) {
       throw new WireCodecError(
         "ZSTD_NOT_INITIALIZED",
killedBy: wire-codec — zstd encodes with cbor+zstd, decodes back
statusReason: wire-codec.encode: zstd not initialized — await ensureWireCodecReady() first

[NoCoverage] BlockStatement
src/codec.ts:320:21
     );
   }
   if (opts.zstd) {
-    if (!zstdReady) {
-      throw new WireCodecError(
-        "ZSTD_NOT_INITIALIZED",
-        "wire-codec.encode: zstd not initialized — await ensureWireCodecReady() first",
-      );
-    }
+    if (!zstdReady) {}
     // Phase 2.F.B: per-frame opportunistic v3 envelope (peer-index compaction).
     // If envelope=3 AND peerIndex is a valid uint8 AND the value is v3-encodable,

[Killed] ConditionalExpression
src/codec.ts:330:7
     // If envelope=3 AND peerIndex is a valid uint8 AND the value is v3-encodable,
     // emit 0xCA. Falls back to v2 (then v1) per-frame — no protocol break.
     const useV3 =
-      opts.envelope === 3 &&
-      typeof opts.peerIndex === "number" &&
-      canEncodeAsV3(value, opts.peerIndex);
+      false;
     // v2 fallback: when envelope=3 fails v3 checks, try v2 (if value is
     // v2-encodable). Also handles envelope=2 directly.
killedBy: envelope-v3 realistic bench (random hex pubkeys) v3 savings summary across all 5 random pubkeys (dictless, 2-char body)
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
src/codec.ts:330:7
     // If envelope=3 AND peerIndex is a valid uint8 AND the value is v3-encodable,
     // emit 0xCA. Falls back to v2 (then v1) per-frame — no protocol break.
     const useV3 =
-      opts.envelope === 3 &&
-      typeof opts.peerIndex === "number" &&
+      opts.envelope === 3 || typeof opts.peerIndex === "number" &&
       canEncodeAsV3(value, opts.peerIndex);
     // v2 fallback: when envelope=3 fails v3 checks, try v2 (if value is
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) envelope=2 with peerIndex=0 produces 0xC8, not 0xCA
statusReason: expected 202 to be 200 // Object.is equality

[Killed] LogicalOperator
src/codec.ts:336:7
     // v2 fallback: when envelope=3 fails v3 checks, try v2 (if value is
     // v2-encodable). Also handles envelope=2 directly.
     const useV2 =
-      !useV3 &&
-      (opts.envelope === 2 || opts.envelope === 3) &&
-      canEncodeAsV2(value);
+      !useV3 && (opts.envelope === 2 || opts.envelope === 3) || canEncodeAsV2(value);
     if (useV3) {
       const cborSrc = toV3(value as Record<string, unknown>, opts.peerIndex!);
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) v2 frames are smaller than v1 for short RU messages
statusReason: expected 68 to be less than 68

[Killed] BooleanLiteral
src/codec.ts:336:7
     // v2 fallback: when envelope=3 fails v3 checks, try v2 (if value is
     // v2-encodable). Also handles envelope=2 directly.
     const useV2 =
-      !useV3 &&
+      useV3 &&
       (opts.envelope === 2 || opts.envelope === 3) &&
       canEncodeAsV2(value);
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected 198 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:337:8
     // v2-encodable). Also handles envelope=2 directly.
     const useV2 =
       !useV3 &&
-      (opts.envelope === 2 || opts.envelope === 3) &&
+      (false || opts.envelope === 3) &&
       canEncodeAsV2(value);
     if (useV3) {
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected 198 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:337:31
     // v2-encodable). Also handles envelope=2 directly.
     const useV2 =
       !useV3 &&
-      (opts.envelope === 2 || opts.envelope === 3) &&
+      (opts.envelope === 2 || false) &&
       canEncodeAsV2(value);
     if (useV3) {
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) encoder falls back to v2 when peerIndex is missing
statusReason: expected 198 to be 200 // Object.is equality

[Killed] BlockStatement
src/codec.ts:339:16
       !useV3 &&
       (opts.envelope === 2 || opts.envelope === 3) &&
       canEncodeAsV2(value);
-    if (useV3) {
-      const cborSrc = toV3(value as Record<string, unknown>, opts.peerIndex!);
-      const cborBytes = sharedCborEncoder.encode(cborSrc);
-      // 0xCA + dict-id byte (0x00 = dictless) + peer-index byte.
-      let compressed: Uint8Array;
-      let dictId = 0x00;
-      if (opts.dict !== undefined) {
-        const dictBytes = getDictBytes(opts.dict);
-        const id = DICT_NAME_TO_ID[opts.dict];
-        if (dictBytes !== undefined && id !== undefined && cctxHandle !== null) {
-          compressed = compressUsingDict(cctxHandle, cborBytes, dictBytes, ZSTD_LEVEL);
-          dictId = id;
-        } else {
-          compressed = zstdCompress(cborBytes, ZSTD_LEVEL);
-        }
-      } else {
-        compressed = zstdCompress(cborBytes, ZSTD_LEVEL);
-      }
-      const out = new Uint8Array(3 + compressed.length);
-      out[0] = ZSTD_V3_MAGIC_PREFIX;
-      out[1] = dictId;
-      out[2] = opts.peerIndex! & 0xff;
-      out.set(compressed, 3);
-      return asWireBytes(out);
-    }
+    if (useV3) {}
     // Phase 2.F.A: per-frame opportunistic v2 envelope. If the value can't fit
     // the v2 shape (unknown kind / bad id / ts out of window) we silently emit
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: expected 198 to be 202 // Object.is equality

[Killed] EqualityOperator
src/codec.ts:348:40
       if (opts.dict !== undefined) {
         const dictBytes = getDictBytes(opts.dict);
         const id = DICT_NAME_TO_ID[opts.dict];
-        if (dictBytes !== undefined && id !== undefined && cctxHandle !== null) {
+        if (dictBytes !== undefined && id === undefined && cctxHandle !== null) {
           compressed = compressUsingDict(cctxHandle, cborBytes, dictBytes, ZSTD_LEVEL);
           dictId = id;
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip with each shipped dict (0xCA 0x01/0x02/0x03 <peerIndex>)
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/codec.ts:348:40
       if (opts.dict !== undefined) {
         const dictBytes = getDictBytes(opts.dict);
         const id = DICT_NAME_TO_ID[opts.dict];
-        if (dictBytes !== undefined && id !== undefined && cctxHandle !== null) {
+        if (dictBytes !== undefined && true && cctxHandle !== null) {
           compressed = compressUsingDict(cctxHandle, cborBytes, dictBytes, ZSTD_LEVEL);
           dictId = id;

[Killed] ArithmeticOperator
src/codec.ts:357:34
       } else {
         compressed = zstdCompress(cborBytes, ZSTD_LEVEL);
       }
-      const out = new Uint8Array(3 + compressed.length);
+      const out = new Uint8Array(3 - compressed.length);
       out[0] = ZSTD_V3_MAGIC_PREFIX;
       out[1] = dictId;
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: Invalid typed array length: -64

[Killed] BlockStatement
src/codec.ts:369:16
     // v1 — byte-identical to pre-2.F.A output, no protocol break.
     const cborSrc = useV2 ? toV2(value as Record<string, unknown>) : value;
     const cborBytes = sharedCborEncoder.encode(cborSrc);
-    if (useV2) {
-      // 0xC8 + dict-id byte (0x00 = dictless). All C1 caps still apply via decode.
-      let compressed: Uint8Array;
-      let dictId = 0x00;
-      if (opts.dict !== undefined) {
-        const dictBytes = getDictBytes(opts.dict);
-        const id = DICT_NAME_TO_ID[opts.dict];
-        if (dictBytes !== undefined && id !== undefined && cctxHandle !== null) {
-          compressed = compressUsingDict(cctxHandle, cborBytes, dictBytes, ZSTD_LEVEL);
-          dictId = id;
-        } else {
-          compressed = zstdCompress(cborBytes, ZSTD_LEVEL);
-        }
-      } else {
-        compressed = zstdCompress(cborBytes, ZSTD_LEVEL);
-      }
-      const out = new Uint8Array(2 + compressed.length);
-      out[0] = ZSTD_V2_MAGIC_PREFIX;
-      out[1] = dictId;
-      out.set(compressed, 2);
-      return asWireBytes(out);
-    }
+    if (useV2) {}
     // Dict path (0xC7 + dict-id): used only when dict is in cache. On miss we
     // silently fall back to 0xC6 — keeps the encoder sync and tolerant of
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected 198 to be 200 // Object.is equality

[Killed] ArithmeticOperator
src/codec.ts:385:34
       } else {
         compressed = zstdCompress(cborBytes, ZSTD_LEVEL);
       }
-      const out = new Uint8Array(2 + compressed.length);
+      const out = new Uint8Array(2 - compressed.length);
       out[0] = ZSTD_V2_MAGIC_PREFIX;
       out[1] = dictId;
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: Invalid typed array length: -72
