[Killed] BlockStatement
src/codec.ts:394:34
     // Dict path (0xC7 + dict-id): used only when dict is in cache. On miss we
     // silently fall back to 0xC6 — keeps the encoder sync and tolerant of
     // preload failures (offline, fetch reject, etc.).
-    if (opts.dict !== undefined) {
-      const dictBytes = getDictBytes(opts.dict);
-      const dictId = DICT_NAME_TO_ID[opts.dict];
-      if (dictBytes !== undefined && dictId !== undefined && cctxHandle !== null) {
-        const compressed = compressUsingDict(cctxHandle, cborBytes, dictBytes, ZSTD_LEVEL);
-        const out = new Uint8Array(2 + compressed.length);
-        out[0] = ZSTD_DICT_MAGIC_PREFIX;
-        out[1] = dictId;
-        out.set(compressed, 2);
-        return asWireBytes(out);
-      }
-      // Fall through to dictless path.
-    }
+    if (opts.dict !== undefined) {}
     const compressed = zstdCompress(cborBytes, ZSTD_LEVEL);
     const out = new Uint8Array(1 + compressed.length);
killedBy: Phase 2.E.B — zstd dict negotiation + encoder encodes with shared dict, prefixes 0xC7 + dict-id, round-trips
statusReason: expected 198 to be 199 // Object.is equality

[Killed] BlockStatement
src/codec.ts:397:83
     if (opts.dict !== undefined) {
       const dictBytes = getDictBytes(opts.dict);
       const dictId = DICT_NAME_TO_ID[opts.dict];
-      if (dictBytes !== undefined && dictId !== undefined && cctxHandle !== null) {
-        const compressed = compressUsingDict(cctxHandle, cborBytes, dictBytes, ZSTD_LEVEL);
-        const out = new Uint8Array(2 + compressed.length);
-        out[0] = ZSTD_DICT_MAGIC_PREFIX;
-        out[1] = dictId;
-        out.set(compressed, 2);
-        return asWireBytes(out);
-      }
+      if (dictBytes !== undefined && dictId !== undefined && cctxHandle !== null) {}
       // Fall through to dictless path.
     }
killedBy: Phase 2.E.B — zstd dict negotiation + encoder encodes with shared dict, prefixes 0xC7 + dict-id, round-trips
statusReason: expected 198 to be 199 // Object.is equality

[Killed] EqualityOperator
src/codec.ts:397:38
     if (opts.dict !== undefined) {
       const dictBytes = getDictBytes(opts.dict);
       const dictId = DICT_NAME_TO_ID[opts.dict];
-      if (dictBytes !== undefined && dictId !== undefined && cctxHandle !== null) {
+      if (dictBytes !== undefined && dictId === undefined && cctxHandle !== null) {
         const compressed = compressUsingDict(cctxHandle, cborBytes, dictBytes, ZSTD_LEVEL);
         const out = new Uint8Array(2 + compressed.length);
killedBy: Phase 2.E.B — zstd dict negotiation + encoder encodes with shared dict, prefixes 0xC7 + dict-id, round-trips
statusReason: expected 198 to be 199 // Object.is equality

[Killed] ArithmeticOperator
src/codec.ts:399:36
       const dictId = DICT_NAME_TO_ID[opts.dict];
       if (dictBytes !== undefined && dictId !== undefined && cctxHandle !== null) {
         const compressed = compressUsingDict(cctxHandle, cborBytes, dictBytes, ZSTD_LEVEL);
-        const out = new Uint8Array(2 + compressed.length);
+        const out = new Uint8Array(2 - compressed.length);
         out[0] = ZSTD_DICT_MAGIC_PREFIX;
         out[1] = dictId;
killedBy: Phase 2.E.B — zstd dict negotiation + encoder encodes with shared dict, prefixes 0xC7 + dict-id, round-trips
statusReason: Invalid typed array length: -76

[Killed] ArithmeticOperator
src/codec.ts:408:32
       // Fall through to dictless path.
     }
     const compressed = zstdCompress(cborBytes, ZSTD_LEVEL);
-    const out = new Uint8Array(1 + compressed.length);
+    const out = new Uint8Array(1 - compressed.length);
     out[0] = ZSTD_MAGIC_PREFIX;
     out.set(compressed, 1);
killedBy: wire-codec — zstd encodes with cbor+zstd, decodes back
statusReason: Invalid typed array length: -86

[Killed] ConditionalExpression
src/codec.ts:413:7
     out.set(compressed, 1);
     return asWireBytes(out);
   }
-  if (opts.cbor) {
+  if (false) {
     return asWireBytes(sharedCborEncoder.encode(value) as Uint8Array);
   }
killedBy: wire-codec opts.cbor=true emits CBOR
statusReason: expected 123 not to be 123 // Object.is equality

[Killed] BlockStatement
src/codec.ts:413:18
     out.set(compressed, 1);
     return asWireBytes(out);
   }
-  if (opts.cbor) {
-    return asWireBytes(sharedCborEncoder.encode(value) as Uint8Array);
-  }
+  if (opts.cbor) {}
   return asWireBytes(enc.encode(JSON.stringify(value)));
 }
killedBy: wire-codec opts.cbor=true emits CBOR
statusReason: expected 123 not to be 123 // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:420:7
 }
 
 export function decode(bytes: WireBytes, opts?: DecodeOpts): unknown {
-  if (bytes.length === 0) {
+  if (false) {
     throw new WireCodecError("EMPTY_INPUT", "wire-codec.decode: empty input");
   }
killedBy: decode — EMPTY_INPUT throws WireCodecError with code EMPTY_INPUT on empty Uint8Array
statusReason: expected error to be instance of WireCodecError

[Killed] EqualityOperator
src/codec.ts:420:7
 }
 
 export function decode(bytes: WireBytes, opts?: DecodeOpts): unknown {
-  if (bytes.length === 0) {
+  if (bytes.length !== 0) {
     throw new WireCodecError("EMPTY_INPUT", "wire-codec.decode: empty input");
   }
killedBy: decode — EMPTY_INPUT throws WireCodecError with code EMPTY_INPUT on empty Uint8Array
statusReason: expected error to be instance of WireCodecError

[Survived] StringLiteral
src/codec.ts:421:45
 
 export function decode(bytes: WireBytes, opts?: DecodeOpts): unknown {
   if (bytes.length === 0) {
-    throw new WireCodecError("EMPTY_INPUT", "wire-codec.decode: empty input");
+    throw new WireCodecError("EMPTY_INPUT", "");
   }
   const first = bytes[0];

[Killed] BlockStatement
src/codec.ts:424:65
     throw new WireCodecError("EMPTY_INPUT", "wire-codec.decode: empty input");
   }
   const first = bytes[0];
-  if (first === JSON_OPEN_BRACE || first === JSON_OPEN_BRACKET) {
-    return JSON.parse(dec.decode(bytes));
-  }
+  if (first === JSON_OPEN_BRACE || first === JSON_OPEN_BRACKET) {}
   if (first === ZSTD_V3_MAGIC_PREFIX) {
     if (!zstdReady) {
killedBy: wire-codec JSON-encodes by default, decodes back
statusReason: JavaScript does not support arrays, maps, or strings with length over 4294967295

[Killed] ConditionalExpression
src/codec.ts:424:36
     throw new WireCodecError("EMPTY_INPUT", "wire-codec.decode: empty input");
   }
   const first = bytes[0];
-  if (first === JSON_OPEN_BRACE || first === JSON_OPEN_BRACKET) {
+  if (first === JSON_OPEN_BRACE || false) {
     return JSON.parse(dec.decode(bytes));
   }
killedBy: wire-codec decode accepts JSON arrays too
statusReason: JavaScript does not support arrays, maps, or strings with length over 4294967295

[Killed] BooleanLiteral
src/codec.ts:428:9
     return JSON.parse(dec.decode(bytes));
   }
   if (first === ZSTD_V3_MAGIC_PREFIX) {
-    if (!zstdReady) {
+    if (zstdReady) {
       throw new WireCodecError(
         "ZSTD_NOT_INITIALIZED",
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: wire-codec.decode: zstd-v3 payload received before ensureWireCodecReady()

[NoCoverage] BlockStatement
src/codec.ts:428:21
     return JSON.parse(dec.decode(bytes));
   }
   if (first === ZSTD_V3_MAGIC_PREFIX) {
-    if (!zstdReady) {
-      throw new WireCodecError(
-        "ZSTD_NOT_INITIALIZED",
-        "wire-codec.decode: zstd-v3 payload received before ensureWireCodecReady()",
-      );
-    }
+    if (!zstdReady) {}
     if (bytes.length < 3) {
       throw new WireCodecError(

[Killed] ConditionalExpression
src/codec.ts:434:9
         "wire-codec.decode: zstd-v3 payload received before ensureWireCodecReady()",
       );
     }
-    if (bytes.length < 3) {
+    if (false) {
       throw new WireCodecError(
         "ZSTD_DECODE_FAILED",
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) rejects truncated 0xCA frame (< 3 header bytes)
statusReason: expected [Function] to throw error matching /truncated zstd-v3 frame/ but got 'wire-codec.decode: zstd frame truncat…'

[Killed] BlockStatement
src/codec.ts:434:27
         "wire-codec.decode: zstd-v3 payload received before ensureWireCodecReady()",
       );
     }
-    if (bytes.length < 3) {
-      throw new WireCodecError(
-        "ZSTD_DECODE_FAILED",
-        "wire-codec.decode: truncated zstd-v3 frame (need 3 header bytes)",
-      );
-    }
+    if (bytes.length < 3) {}
     if (bytes.length - 3 > ZSTD_MAX_COMPRESSED_BYTES) {
       throw new WireCodecError(
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) rejects truncated 0xCA frame (< 3 header bytes)
statusReason: expected [Function] to throw error matching /truncated zstd-v3 frame/ but got 'wire-codec.decode: zstd frame truncat…'

[Killed] EqualityOperator
src/codec.ts:440:9
         "wire-codec.decode: truncated zstd-v3 frame (need 3 header bytes)",
       );
     }
-    if (bytes.length - 3 > ZSTD_MAX_COMPRESSED_BYTES) {
+    if (bytes.length - 3 <= ZSTD_MAX_COMPRESSED_BYTES) {
       throw new WireCodecError(
         "COMPRESSED_TOO_LARGE",
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: wire-codec.decode: zstd-v3 payload exceeds compressed-size cap

[Killed] ConditionalExpression
src/codec.ts:440:9
         "wire-codec.decode: truncated zstd-v3 frame (need 3 header bytes)",
       );
     }
-    if (bytes.length - 3 > ZSTD_MAX_COMPRESSED_BYTES) {
+    if (false) {
       throw new WireCodecError(
         "COMPRESSED_TOO_LARGE",
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) rejects 0xCA frame whose compressed length exceeds the cap
statusReason: expected [Function] to throw error matching /exceeds compressed-size cap/ but got 'wire-codec.decode: zstd magic mismatch'

[Survived] ArithmeticOperator
src/codec.ts:444:51
       throw new WireCodecError(
         "COMPRESSED_TOO_LARGE",
         "wire-codec.decode: zstd-v3 payload exceeds compressed-size cap",
-        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length - 3 },
+        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length + 3 },
       );
     }

[Killed] EqualityOperator
src/codec.ts:455:9
     const compressed = bytes.subarray(3);
     validateZstdFrame(compressed, ZSTD_MAX_DECOMPRESSED_BYTES);
     let cborBytes: Uint8Array;
-    if (dictId === 0x00) {
+    if (dictId !== 0x00) {
       cborBytes = zstdDecompress(compressed, ZSTD_DECOMPRESS_OPTS);
     } else {
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: wire-codec.decode: unknown zstd dict-id 0x0 (v3)

[Killed] ConditionalExpression
src/codec.ts:455:9
     const compressed = bytes.subarray(3);
     validateZstdFrame(compressed, ZSTD_MAX_DECOMPRESSED_BYTES);
     let cborBytes: Uint8Array;
-    if (dictId === 0x00) {
+    if (false) {
       cborBytes = zstdDecompress(compressed, ZSTD_DECOMPRESS_OPTS);
     } else {
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: wire-codec.decode: unknown zstd dict-id 0x0 (v3)

[Killed] EqualityOperator
src/codec.ts:481:9
       }
       cborBytes = decompressUsingDict(dctxHandle, compressed, dictBytes, ZSTD_DECOMPRESS_OPTS);
     }
-    if (cborBytes.length > ZSTD_MAX_DECOMPRESSED_BYTES) {
+    if (cborBytes.length <= ZSTD_MAX_DECOMPRESSED_BYTES) {
       throw new WireCodecError(
         "DECOMPRESSED_TOO_LARGE",
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: wire-codec.decode: zstd-v3 payload exceeds decompressed-size cap

[Killed] ConditionalExpression
src/codec.ts:481:9
       }
       cborBytes = decompressUsingDict(dctxHandle, compressed, dictBytes, ZSTD_DECOMPRESS_OPTS);
     }
-    if (cborBytes.length > ZSTD_MAX_DECOMPRESSED_BYTES) {
+    if (true) {
       throw new WireCodecError(
         "DECOMPRESSED_TOO_LARGE",
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: wire-codec.decode: zstd-v3 payload exceeds decompressed-size cap

[Killed] ConditionalExpression
src/codec.ts:490:7
     }
     return fromV3(cborDecode(cborBytes) as Record<string, unknown>, opts?.resolvePeer);
   }
-  if (first === ZSTD_MAGIC_PREFIX) {
+  if (false) {
     if (!zstdReady) {
       throw new WireCodecError(
killedBy: wire-codec — zstd encodes with cbor+zstd, decodes back
statusReason: Data read, but end of buffer not reached

[Killed] BooleanLiteral
src/codec.ts:491:9
     return fromV3(cborDecode(cborBytes) as Record<string, unknown>, opts?.resolvePeer);
   }
   if (first === ZSTD_MAGIC_PREFIX) {
-    if (!zstdReady) {
+    if (zstdReady) {
       throw new WireCodecError(
         "ZSTD_NOT_INITIALIZED",
killedBy: wire-codec — zstd encodes with cbor+zstd, decodes back
statusReason: wire-codec.decode: zstd payload received before ensureWireCodecReady()

[Killed] ConditionalExpression
src/codec.ts:491:9
     return fromV3(cborDecode(cborBytes) as Record<string, unknown>, opts?.resolvePeer);
   }
   if (first === ZSTD_MAGIC_PREFIX) {
-    if (!zstdReady) {
+    if (true) {
       throw new WireCodecError(
         "ZSTD_NOT_INITIALIZED",
killedBy: wire-codec — zstd encodes with cbor+zstd, decodes back
statusReason: wire-codec.decode: zstd payload received before ensureWireCodecReady()

[Killed] ConditionalExpression
src/codec.ts:497:9
         "wire-codec.decode: zstd payload received before ensureWireCodecReady()",
       );
     }
-    if (bytes.length - 1 > ZSTD_MAX_COMPRESSED_BYTES) {
+    if (false) {
       throw new WireCodecError(
         "COMPRESSED_TOO_LARGE",
killedBy: Phase 2.E.B — zstd dict negotiation + encoder rejects a zstd frame whose compressed length exceeds the cap (bomb defense)
statusReason: expected [Function] to throw error matching /exceeds compressed-size cap/ but got 'wire-codec.decode: zstd magic mismatch'

[Killed] BlockStatement
src/codec.ts:497:55
         "wire-codec.decode: zstd payload received before ensureWireCodecReady()",
       );
     }
-    if (bytes.length - 1 > ZSTD_MAX_COMPRESSED_BYTES) {
-      throw new WireCodecError(
-        "COMPRESSED_TOO_LARGE",
-        "wire-codec.decode: zstd payload exceeds compressed-size cap",
-        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length - 1 },
-      );
-    }
+    if (bytes.length - 1 > ZSTD_MAX_COMPRESSED_BYTES) {}
     const compressed = bytes.subarray(1);
     validateZstdFrame(compressed, ZSTD_MAX_DECOMPRESSED_BYTES);
killedBy: decode — COMPRESSED_TOO_LARGE throws WireCodecError COMPRESSED_TOO_LARGE when compressed payload > 64 KiB
statusReason: expected 'ZSTD_NOT_INITIALIZED' to be 'COMPRESSED_TOO_LARGE' // Object.is equality

[Killed] ArithmeticOperator
src/codec.ts:501:51
       throw new WireCodecError(
         "COMPRESSED_TOO_LARGE",
         "wire-codec.decode: zstd payload exceeds compressed-size cap",
-        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length - 1 },
+        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length + 1 },
       );
     }
killedBy: decode — COMPRESSED_TOO_LARGE throws WireCodecError COMPRESSED_TOO_LARGE when compressed payload > 64 KiB
statusReason: expected 'ZSTD_NOT_INITIALIZED' to be 'COMPRESSED_TOO_LARGE' // Object.is equality

[Killed] EqualityOperator
src/codec.ts:507:9
     const compressed = bytes.subarray(1);
     validateZstdFrame(compressed, ZSTD_MAX_DECOMPRESSED_BYTES);
     const cborBytes = zstdDecompress(compressed, ZSTD_DECOMPRESS_OPTS);
-    if (cborBytes.length > ZSTD_MAX_DECOMPRESSED_BYTES) {
+    if (cborBytes.length <= ZSTD_MAX_DECOMPRESSED_BYTES) {
       throw new WireCodecError(
         "DECOMPRESSED_TOO_LARGE",
killedBy: wire-codec — zstd encodes with cbor+zstd, decodes back
statusReason: wire-codec.decode: zstd payload exceeds decompressed-size cap

[Killed] ConditionalExpression
src/codec.ts:507:9
     const compressed = bytes.subarray(1);
     validateZstdFrame(compressed, ZSTD_MAX_DECOMPRESSED_BYTES);
     const cborBytes = zstdDecompress(compressed, ZSTD_DECOMPRESS_OPTS);
-    if (cborBytes.length > ZSTD_MAX_DECOMPRESSED_BYTES) {
+    if (true) {
       throw new WireCodecError(
         "DECOMPRESSED_TOO_LARGE",
killedBy: wire-codec — zstd encodes with cbor+zstd, decodes back
statusReason: wire-codec.decode: zstd payload exceeds decompressed-size cap

[Killed] BooleanLiteral
src/codec.ts:517:9
     return cborDecode(cborBytes);
   }
   if (first === ZSTD_V2_MAGIC_PREFIX) {
-    if (!zstdReady) {
+    if (zstdReady) {
       throw new WireCodecError(
         "ZSTD_NOT_INITIALIZED",
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: wire-codec.decode: zstd-v2 payload received before ensureWireCodecReady()

[Survived] ConditionalExpression
src/codec.ts:517:9
     return cborDecode(cborBytes);
   }
   if (first === ZSTD_V2_MAGIC_PREFIX) {
-    if (!zstdReady) {
+    if (false) {
       throw new WireCodecError(
         "ZSTD_NOT_INITIALIZED",

[NoCoverage] StringLiteral
src/codec.ts:520:9
     if (!zstdReady) {
       throw new WireCodecError(
         "ZSTD_NOT_INITIALIZED",
-        "wire-codec.decode: zstd-v2 payload received before ensureWireCodecReady()",
+        "",
       );
     }

[Killed] EqualityOperator
src/codec.ts:523:9
         "wire-codec.decode: zstd-v2 payload received before ensureWireCodecReady()",
       );
     }
-    if (bytes.length < 2) {
+    if (bytes.length >= 2) {
       throw new WireCodecError(
         "ZSTD_DECODE_FAILED",
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: wire-codec.decode: truncated zstd-v2 frame

[Survived] ConditionalExpression
src/codec.ts:523:9
         "wire-codec.decode: zstd-v2 payload received before ensureWireCodecReady()",
       );
     }
-    if (bytes.length < 2) {
+    if (false) {
       throw new WireCodecError(
         "ZSTD_DECODE_FAILED",

[Killed] EqualityOperator
src/codec.ts:529:9
         "wire-codec.decode: truncated zstd-v2 frame",
       );
     }
-    if (bytes.length - 2 > ZSTD_MAX_COMPRESSED_BYTES) {
+    if (bytes.length - 2 <= ZSTD_MAX_COMPRESSED_BYTES) {
       throw new WireCodecError(
         "COMPRESSED_TOO_LARGE",
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: wire-codec.decode: zstd-v2 payload exceeds compressed-size cap

[Killed] BlockStatement
src/codec.ts:529:55
         "wire-codec.decode: truncated zstd-v2 frame",
       );
     }
-    if (bytes.length - 2 > ZSTD_MAX_COMPRESSED_BYTES) {
-      throw new WireCodecError(
-        "COMPRESSED_TOO_LARGE",
-        "wire-codec.decode: zstd-v2 payload exceeds compressed-size cap",
-        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length - 2 },
-      );
-    }
+    if (bytes.length - 2 > ZSTD_MAX_COMPRESSED_BYTES) {}
     const dictId = bytes[1]!;
     const compressed = bytes.subarray(2);
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) rejects 0xC8 frame whose compressed length exceeds the cap
statusReason: expected [Function] to throw error matching /exceeds compressed-size cap/ but got 'wire-codec.decode: zstd magic mismatch'

[Survived] ArithmeticOperator
src/codec.ts:533:51
       throw new WireCodecError(
         "COMPRESSED_TOO_LARGE",
         "wire-codec.decode: zstd-v2 payload exceeds compressed-size cap",
-        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length - 2 },
+        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length + 2 },
       );
     }

[Survived] ObjectLiteral
src/codec.ts:533:9
       throw new WireCodecError(
         "COMPRESSED_TOO_LARGE",
         "wire-codec.decode: zstd-v2 payload exceeds compressed-size cap",
-        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length - 2 },
+        {},
       );
     }

[NoCoverage] StringLiteral
src/codec.ts:547:11
       if (dictName === undefined) {
         throw new WireCodecError(
           "UNKNOWN_DICT_ID",
-          `wire-codec.decode: unknown zstd dict-id 0x${dictId.toString(16)}`,
+          ``,
           { dictId },
         );

[NoCoverage] StringLiteral
src/codec.ts:555:11
       if (dictBytes === undefined) {
         throw new WireCodecError(
           "DICT_NOT_LOADED",
-          `wire-codec.decode: dict ${dictName} not loaded — protocol error (negotiation should have prevented this)`,
+          ``,
         );
       }

[NoCoverage] StringLiteral
src/codec.ts:561:11
       if (dctxHandle === null) {
         throw new WireCodecError(
           "ZSTD_NOT_INITIALIZED",
-          "wire-codec.decode: zstd-v2 dict path not initialized",
+          "",
         );
       }

[NoCoverage] StringLiteral
src/codec.ts:569:9
     if (cborBytes.length > ZSTD_MAX_DECOMPRESSED_BYTES) {
       throw new WireCodecError(
         "DECOMPRESSED_TOO_LARGE",
-        "wire-codec.decode: zstd-v2 payload exceeds decompressed-size cap",
+        "",
         { limit: ZSTD_MAX_DECOMPRESSED_BYTES, size: cborBytes.length },
       );

[Killed] EqualityOperator
src/codec.ts:575:7
     }
     return fromV2(cborDecode(cborBytes) as Record<string, unknown>);
   }
-  if (first === ZSTD_DICT_MAGIC_PREFIX) {
+  if (first !== ZSTD_DICT_MAGIC_PREFIX) {
     if (!zstdReady || dctxHandle === null) {
       throw new WireCodecError(
killedBy: wire-codec opts.cbor=true emits CBOR
statusReason: wire-codec.decode: unknown zstd dict-id 0x0

[Killed] ConditionalExpression
src/codec.ts:575:7
     }
     return fromV2(cborDecode(cborBytes) as Record<string, unknown>);
   }
-  if (first === ZSTD_DICT_MAGIC_PREFIX) {
+  if (true) {
     if (!zstdReady || dctxHandle === null) {
       throw new WireCodecError(
killedBy: wire-codec opts.cbor=true emits CBOR
statusReason: wire-codec.decode: unknown zstd dict-id 0x0

[Killed] BooleanLiteral
src/codec.ts:576:9
     return fromV2(cborDecode(cborBytes) as Record<string, unknown>);
   }
   if (first === ZSTD_DICT_MAGIC_PREFIX) {
-    if (!zstdReady || dctxHandle === null) {
+    if (zstdReady || dctxHandle === null) {
       throw new WireCodecError(
         "ZSTD_NOT_INITIALIZED",
killedBy: Phase 2.E.B — zstd dict negotiation + encoder encodes with shared dict, prefixes 0xC7 + dict-id, round-trips
statusReason: wire-codec.decode: zstd-dict payload received before ensureWireCodecReady()

[Killed] EqualityOperator
src/codec.ts:582:9
         "wire-codec.decode: zstd-dict payload received before ensureWireCodecReady()",
       );
     }
-    if (bytes.length < 2) {
+    if (bytes.length <= 2) {
       throw new WireCodecError(
         "INVALID_DICT_ID_HEADER",
killedBy: decode — UNKNOWN_DICT_ID (0xC7 frame with unknown dict-id) throws WireCodecError UNKNOWN_DICT_ID for dict-id 0xFF not in registry
statusReason: expected 'ZSTD_NOT_INITIALIZED' to be 'UNKNOWN_DICT_ID' // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:589:9
         { frameLen: bytes.length },
       );
     }
-    if (bytes.length - 2 > ZSTD_MAX_COMPRESSED_BYTES) {
+    if (false) {
       throw new WireCodecError(
         "COMPRESSED_TOO_LARGE",
killedBy: decode — UNKNOWN_DICT_ID (0xC7 frame with unknown dict-id) throws WireCodecError UNKNOWN_DICT_ID for dict-id 0xFF not in registry
statusReason: expected 'ZSTD_NOT_INITIALIZED' to be 'UNKNOWN_DICT_ID' // Object.is equality

[Killed] BlockStatement
src/codec.ts:589:55
         { frameLen: bytes.length },
       );
     }
-    if (bytes.length - 2 > ZSTD_MAX_COMPRESSED_BYTES) {
-      throw new WireCodecError(
-        "COMPRESSED_TOO_LARGE",
-        "wire-codec.decode: zstd-dict payload exceeds compressed-size cap",
-        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length - 2 },
-      );
-    }
+    if (bytes.length - 2 > ZSTD_MAX_COMPRESSED_BYTES) {}
     const dictId = bytes[1]!;
     const dictName = DICT_ID_TO_NAME[dictId];
killedBy: Phase 2.E.B — zstd dict negotiation + encoder rejects an oversized zstd-dict frame
statusReason: expected [Function] to throw error matching /exceeds compressed-size cap/ but got 'wire-codec.decode: zstd magic mismatch'

[Survived] ArithmeticOperator
src/codec.ts:593:51
       throw new WireCodecError(
         "COMPRESSED_TOO_LARGE",
         "wire-codec.decode: zstd-dict payload exceeds compressed-size cap",
-        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length - 2 },
+        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length + 2 },
       );
     }

[Killed] EqualityOperator
src/codec.ts:615:9
     const compressed = bytes.subarray(2);
     validateZstdFrame(compressed, ZSTD_MAX_DECOMPRESSED_BYTES);
     const cborBytes = decompressUsingDict(dctxHandle, compressed, dictBytes, ZSTD_DECOMPRESS_OPTS);
-    if (cborBytes.length > ZSTD_MAX_DECOMPRESSED_BYTES) {
+    if (cborBytes.length <= ZSTD_MAX_DECOMPRESSED_BYTES) {
       throw new WireCodecError(
         "DECOMPRESSED_TOO_LARGE",
killedBy: Phase 2.E.B — zstd dict negotiation + encoder encodes with shared dict, prefixes 0xC7 + dict-id, round-trips
statusReason: wire-codec.decode: zstd-dict payload exceeds decompressed-size cap

[Killed] ConditionalExpression
src/codec.ts:615:9
     const compressed = bytes.subarray(2);
     validateZstdFrame(compressed, ZSTD_MAX_DECOMPRESSED_BYTES);
     const cborBytes = decompressUsingDict(dctxHandle, compressed, dictBytes, ZSTD_DECOMPRESS_OPTS);
-    if (cborBytes.length > ZSTD_MAX_DECOMPRESSED_BYTES) {
+    if (true) {
       throw new WireCodecError(
         "DECOMPRESSED_TOO_LARGE",
killedBy: Phase 2.E.B — zstd dict negotiation + encoder encodes with shared dict, prefixes 0xC7 + dict-id, round-trips
statusReason: wire-codec.decode: zstd-dict payload exceeds decompressed-size cap

[NoCoverage] StringLiteral
src/codec.ts:618:9
     if (cborBytes.length > ZSTD_MAX_DECOMPRESSED_BYTES) {
       throw new WireCodecError(
         "DECOMPRESSED_TOO_LARGE",
-        "wire-codec.decode: zstd-dict payload exceeds decompressed-size cap",
+        "",
         { limit: ZSTD_MAX_DECOMPRESSED_BYTES, size: cborBytes.length },
       );

[Killed] EqualityOperator
src/codec.ts:640:21
  * Uint8Array / TypedArray pass through unchanged (CBOR encodes by content).
  */
 export function canonicalizeEnvelope<T>(v: T): T {
-  if (v === null || typeof v !== "object") return v;
+  if (v === null || typeof v === "object") return v;
   if (Array.isArray(v)) return v.map((x) => canonicalizeEnvelope(x)) as unknown as T;
   if (ArrayBuffer.isView(v) || v instanceof ArrayBuffer) return v;
killedBy: canonicalizeEnvelope (A9) two key-order permutations encode to identical bytes
statusReason: expected Buffer[ 185, 0, 3, 97, 122, 1, …(-75) ] to deeply equal Buffer[ 185, 0, 3, 97, 109, 185, …(22) ]

[Killed] EqualityOperator
src/codec.ts:640:7
  * Uint8Array / TypedArray pass through unchanged (CBOR encodes by content).
  */
 export function canonicalizeEnvelope<T>(v: T): T {
-  if (v === null || typeof v !== "object") return v;
+  if (v !== null || typeof v !== "object") return v;
   if (Array.isArray(v)) return v.map((x) => canonicalizeEnvelope(x)) as unknown as T;
   if (ArrayBuffer.isView(v) || v instanceof ArrayBuffer) return v;
killedBy: canonicalizeEnvelope (A9) two key-order permutations encode to identical bytes
statusReason: expected Buffer[ 185, 0, 3, 97, 122, 1, …(-75) ] to deeply equal Buffer[ 185, 0, 3, 97, 109, 185, …(22) ]

[Killed] ConditionalExpression
src/codec.ts:642:7
 export function canonicalizeEnvelope<T>(v: T): T {
   if (v === null || typeof v !== "object") return v;
   if (Array.isArray(v)) return v.map((x) => canonicalizeEnvelope(x)) as unknown as T;
-  if (ArrayBuffer.isView(v) || v instanceof ArrayBuffer) return v;
+  if (false) return v;
   const src = v as Record<string, unknown>;
   const out: Record<string, unknown> = {};
killedBy: canonicalizeEnvelope (A9) passes Uint8Array through unchanged
statusReason: expected { '0': 1, '1': 2, '2': 3 } to be Uint8Array[ 1, 2, 3 ] // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:642:7
 export function canonicalizeEnvelope<T>(v: T): T {
   if (v === null || typeof v !== "object") return v;
   if (Array.isArray(v)) return v.map((x) => canonicalizeEnvelope(x)) as unknown as T;
-  if (ArrayBuffer.isView(v) || v instanceof ArrayBuffer) return v;
+  if (true) return v;
   const src = v as Record<string, unknown>;
   const out: Record<string, unknown> = {};
killedBy: canonicalizeEnvelope (A9) two key-order permutations encode to identical bytes
statusReason: expected Buffer[ 185, 0, 3, 97, 122, 1, …(-75) ] to deeply equal Buffer[ 185, 0, 3, 97, 109, 185, …(22) ]

[Killed] MethodExpression
src/codec.ts:645:19
   if (ArrayBuffer.isView(v) || v instanceof ArrayBuffer) return v;
   const src = v as Record<string, unknown>;
   const out: Record<string, unknown> = {};
-  for (const k of Object.keys(src).sort()) out[k] = canonicalizeEnvelope(src[k]);
+  for (const k of Object.keys(src)) out[k] = canonicalizeEnvelope(src[k]);
   return out as unknown as T;
 }
killedBy: canonicalizeEnvelope (A9) two key-order permutations encode to identical bytes
statusReason: expected Buffer[ 185, 0, 3, 97, 122, 1, …(-75) ] to deeply equal Buffer[ 185, 0, 3, 97, 109, 185, …(22) ]

[Killed] ConditionalExpression
src/codec.ts:651:7
 
 /** Sniff helper: returns true if bytes look like CBOR (not JSON). */
 export function isCborMagic(bytes: Uint8Array): boolean {
-  if (bytes.length === 0) return false;
+  if (true) return false;
   const first = bytes[0];
   return first !== JSON_OPEN_BRACE && first !== JSON_OPEN_BRACKET;
killedBy: wire-codec opts.cbor=true emits CBOR
statusReason: expected false to be true // Object.is equality
