[Killed] EqualityOperator
src/codec.ts:651:7
 
 /** Sniff helper: returns true if bytes look like CBOR (not JSON). */
 export function isCborMagic(bytes: Uint8Array): boolean {
-  if (bytes.length === 0) return false;
+  if (bytes.length !== 0) return false;
   const first = bytes[0];
   return first !== JSON_OPEN_BRACE && first !== JSON_OPEN_BRACKET;
killedBy: wire-codec opts.cbor=true emits CBOR
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/codec.ts:653:39
 export function isCborMagic(bytes: Uint8Array): boolean {
   if (bytes.length === 0) return false;
   const first = bytes[0];
-  return first !== JSON_OPEN_BRACE && first !== JSON_OPEN_BRACKET;
+  return first !== JSON_OPEN_BRACE && first === JSON_OPEN_BRACKET;
 }
 
killedBy: wire-codec opts.cbor=true emits CBOR
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:653:10
 export function isCborMagic(bytes: Uint8Array): boolean {
   if (bytes.length === 0) return false;
   const first = bytes[0];
-  return first !== JSON_OPEN_BRACE && first !== JSON_OPEN_BRACKET;
+  return false;
 }
 
killedBy: wire-codec opts.cbor=true emits CBOR
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/codec.ts:668:31
   theirs: readonly WireCap[],
 ): WireCap {
   const priority: WireCap[] = ["cbor+zstd", "cbor", "json"];
-  for (const cap of priority) {
-    if (mine.includes(cap) && theirs.includes(cap)) return cap;
-  }
+  for (const cap of priority) {}
   return "json";
 }
killedBy: negotiateCap picks highest mutual
statusReason: expected 'json' to be 'cbor' // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:669:9
 ): WireCap {
   const priority: WireCap[] = ["cbor+zstd", "cbor", "json"];
   for (const cap of priority) {
-    if (mine.includes(cap) && theirs.includes(cap)) return cap;
+    if (true) return cap;
   }
   return "json";
killedBy: negotiateCap picks highest mutual
statusReason: expected 'cbor+zstd' to be 'cbor' // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:669:9
 ): WireCap {
   const priority: WireCap[] = ["cbor+zstd", "cbor", "json"];
   for (const cap of priority) {
-    if (mine.includes(cap) && theirs.includes(cap)) return cap;
+    if (false) return cap;
   }
   return "json";
killedBy: negotiateCap picks highest mutual
statusReason: expected 'json' to be 'cbor' // Object.is equality

[Killed] BlockStatement
src/codec.ts:692:32
   othersCaps: readonly (readonly WireCap[])[],
   priority: readonly DictName[] = ALL_DICTS,
 ): DictName | undefined {
-  for (const dict of priority) {
-    if (!mine.includes(dict)) continue;
-    if (othersCaps.every((peer) => peer.includes(dict))) return dict;
-  }
+  for (const dict of priority) {}
   return undefined;
 }
killedBy: negotiateDict (room-wide intersection) picks shared dict when every peer supports it
statusReason: expected undefined to be 'zstd-dict-ru-v1' // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:693:9
   priority: readonly DictName[] = ALL_DICTS,
 ): DictName | undefined {
   for (const dict of priority) {
-    if (!mine.includes(dict)) continue;
+    if (true) continue;
     if (othersCaps.every((peer) => peer.includes(dict))) return dict;
   }
killedBy: negotiateDict (room-wide intersection) picks shared dict when every peer supports it
statusReason: expected undefined to be 'zstd-dict-ru-v1' // Object.is equality

[Killed] BooleanLiteral
src/codec.ts:693:9
   priority: readonly DictName[] = ALL_DICTS,
 ): DictName | undefined {
   for (const dict of priority) {
-    if (!mine.includes(dict)) continue;
+    if (mine.includes(dict)) continue;
     if (othersCaps.every((peer) => peer.includes(dict))) return dict;
   }
killedBy: negotiateDict (room-wide intersection) picks shared dict when every peer supports it
statusReason: expected undefined to be 'zstd-dict-ru-v1' // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:694:9
 ): DictName | undefined {
   for (const dict of priority) {
     if (!mine.includes(dict)) continue;
-    if (othersCaps.every((peer) => peer.includes(dict))) return dict;
+    if (false) return dict;
   }
   return undefined;
killedBy: negotiateDict (room-wide intersection) picks shared dict when every peer supports it
statusReason: expected undefined to be 'zstd-dict-ru-v1' // Object.is equality

[Killed] ArrowFunction
src/codec.ts:694:26
 ): DictName | undefined {
   for (const dict of priority) {
     if (!mine.includes(dict)) continue;
-    if (othersCaps.every((peer) => peer.includes(dict))) return dict;
+    if (othersCaps.every(() => undefined)) return dict;
   }
   return undefined;
killedBy: negotiateDict (room-wide intersection) picks shared dict when every peer supports it
statusReason: expected undefined to be 'zstd-dict-ru-v1' // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:703:5
  *  codec caps — they piggyback on cbor+zstd and are layered in separately. */
 export function capToOpts(cap: WireCap): EncodeOpts {
   switch (cap) {
-    case "json":
-      return { cbor: false, zstd: false };
+    case "json":
     case "cbor":
       return { cbor: true, zstd: false };
killedBy: capToOpts maps caps to encode opts
statusReason: expected { cbor: true, zstd: false } to deeply equal { cbor: false, zstd: false }

[Killed] BooleanLiteral
src/codec.ts:704:22
 export function capToOpts(cap: WireCap): EncodeOpts {
   switch (cap) {
     case "json":
-      return { cbor: false, zstd: false };
+      return { cbor: true, zstd: false };
     case "cbor":
       return { cbor: true, zstd: false };
killedBy: capToOpts maps caps to encode opts
statusReason: expected { cbor: true, zstd: false } to deeply equal { cbor: false, zstd: false }

[Killed] BooleanLiteral
src/codec.ts:704:35
 export function capToOpts(cap: WireCap): EncodeOpts {
   switch (cap) {
     case "json":
-      return { cbor: false, zstd: false };
+      return { cbor: false, zstd: true };
     case "cbor":
       return { cbor: true, zstd: false };
killedBy: capToOpts maps caps to encode opts
statusReason: expected { cbor: false, zstd: true } to deeply equal { cbor: false, zstd: false }

[Killed] ConditionalExpression
src/codec.ts:705:5
   switch (cap) {
     case "json":
       return { cbor: false, zstd: false };
-    case "cbor":
-      return { cbor: true, zstd: false };
+    case "cbor":
     case "cbor+zstd":
     case "zstd-dict-ru-v1":
killedBy: capToOpts maps caps to encode opts
statusReason: expected { cbor: true, zstd: true } to deeply equal { cbor: true, zstd: false }

[Killed] BooleanLiteral
src/codec.ts:706:34
     case "json":
       return { cbor: false, zstd: false };
     case "cbor":
-      return { cbor: true, zstd: false };
+      return { cbor: true, zstd: true };
     case "cbor+zstd":
     case "zstd-dict-ru-v1":
killedBy: capToOpts maps caps to encode opts
statusReason: expected { cbor: true, zstd: true } to deeply equal { cbor: true, zstd: false }

[Killed] BooleanLiteral
src/codec.ts:706:22
     case "json":
       return { cbor: false, zstd: false };
     case "cbor":
-      return { cbor: true, zstd: false };
+      return { cbor: false, zstd: false };
     case "cbor+zstd":
     case "zstd-dict-ru-v1":
killedBy: capToOpts maps caps to encode opts
statusReason: expected { cbor: false, zstd: false } to deeply equal { cbor: true, zstd: false }

[Killed] BooleanLiteral
src/codec.ts:714:34
     case "envelope-v2":
     case "envelope-v3":
       // Dict + envelope caps imply cbor+zstd; selection layered via opts.dict / opts.envelope.
-      return { cbor: true, zstd: true };
+      return { cbor: true, zstd: false };
   }
 }
killedBy: capToOpts maps caps to encode opts
statusReason: expected { cbor: true, zstd: false } to deeply equal { cbor: true, zstd: true }

[Killed] BooleanLiteral
src/codec.ts:714:22
     case "envelope-v2":
     case "envelope-v3":
       // Dict + envelope caps imply cbor+zstd; selection layered via opts.dict / opts.envelope.
-      return { cbor: true, zstd: true };
+      return { cbor: false, zstd: true };
   }
 }
killedBy: capToOpts maps caps to encode opts
statusReason: expected { cbor: false, zstd: true } to deeply equal { cbor: true, zstd: true }

[Killed] BooleanLiteral
src/codec.ts:742:7
  * @throws if zstd not initialized — call `ensureWireCodecReady()` first.
  */
 export function encodeHttpBody(jsonBytes: Uint8Array, dictName?: DictName): HttpWireBytes {
-  if (!zstdReady) {
+  if (zstdReady) {
     throw new WireCodecError(
       "ZSTD_NOT_INITIALIZED",
killedBy: encodeHttpBody / decodeHttpBody round-trips 0xC6 dictless: encode → frame[0]=0xC6 → decode → original
statusReason: wire-codec.encodeHttpBody: zstd not initialized — await ensureWireCodecReady() first

[Survived] ConditionalExpression
src/codec.ts:742:7
  * @throws if zstd not initialized — call `ensureWireCodecReady()` first.
  */
 export function encodeHttpBody(jsonBytes: Uint8Array, dictName?: DictName): HttpWireBytes {
-  if (!zstdReady) {
+  if (false) {
     throw new WireCodecError(
       "ZSTD_NOT_INITIALIZED",

[Killed] BlockStatement
src/codec.ts:748:31
       "wire-codec.encodeHttpBody: zstd not initialized — await ensureWireCodecReady() first",
     );
   }
-  if (dictName !== undefined) {
-    const dictBytes = getDictBytes(dictName);
-    const dictId = DICT_NAME_TO_ID[dictName];
-    if (dictBytes !== undefined && dictId !== undefined && cctxHandle !== null) {
-      const compressed = compressUsingDict(cctxHandle, jsonBytes, dictBytes, ZSTD_LEVEL);
-      // Server protocol: 0xC7 + dict_id u16 BE (high=0x00 since IDs are 0x01–0x03) + frame
-      const out = new Uint8Array(3 + compressed.length);
-      out[0] = ZSTD_DICT_MAGIC_PREFIX;
-      out[1] = (dictId >> 8) & 0xff; // high byte (0x00 for current IDs)
-      out[2] = dictId & 0xff;         // low byte (0x01–0x03)
-      out.set(compressed, 3);
-      return asHttpWireBytes(out);
-    }
-    // Dict not loaded — fall through to dictless.
-  }
+  if (dictName !== undefined) {}
   const compressed = zstdCompress(jsonBytes, ZSTD_LEVEL);
   const out = new Uint8Array(1 + compressed.length);
killedBy: encodeHttpBody / decodeHttpBody round-trips 0xC7 with ru dict: encode → frame[0]=0xC7, frame[2]=0x01 → decode → original
statusReason: expected 198 to be 199 // Object.is equality

[Killed] EqualityOperator
src/codec.ts:751:36
   if (dictName !== undefined) {
     const dictBytes = getDictBytes(dictName);
     const dictId = DICT_NAME_TO_ID[dictName];
-    if (dictBytes !== undefined && dictId !== undefined && cctxHandle !== null) {
+    if (dictBytes !== undefined && dictId === undefined && cctxHandle !== null) {
       const compressed = compressUsingDict(cctxHandle, jsonBytes, dictBytes, ZSTD_LEVEL);
       // Server protocol: 0xC7 + dict_id u16 BE (high=0x00 since IDs are 0x01–0x03) + frame
killedBy: encodeHttpBody / decodeHttpBody round-trips 0xC7 with ru dict: encode → frame[0]=0xC7, frame[2]=0x01 → decode → original
statusReason: expected 198 to be 199 // Object.is equality

[Killed] BlockStatement
src/codec.ts:751:81
   if (dictName !== undefined) {
     const dictBytes = getDictBytes(dictName);
     const dictId = DICT_NAME_TO_ID[dictName];
-    if (dictBytes !== undefined && dictId !== undefined && cctxHandle !== null) {
-      const compressed = compressUsingDict(cctxHandle, jsonBytes, dictBytes, ZSTD_LEVEL);
-      // Server protocol: 0xC7 + dict_id u16 BE (high=0x00 since IDs are 0x01–0x03) + frame
-      const out = new Uint8Array(3 + compressed.length);
-      out[0] = ZSTD_DICT_MAGIC_PREFIX;
-      out[1] = (dictId >> 8) & 0xff; // high byte (0x00 for current IDs)
-      out[2] = dictId & 0xff;         // low byte (0x01–0x03)
-      out.set(compressed, 3);
-      return asHttpWireBytes(out);
-    }
+    if (dictBytes !== undefined && dictId !== undefined && cctxHandle !== null) {}
     // Dict not loaded — fall through to dictless.
   }
killedBy: encodeHttpBody / decodeHttpBody round-trips 0xC7 with ru dict: encode → frame[0]=0xC7, frame[2]=0x01 → decode → original
statusReason: expected 198 to be 199 // Object.is equality

[Killed] ArithmeticOperator
src/codec.ts:754:34
     if (dictBytes !== undefined && dictId !== undefined && cctxHandle !== null) {
       const compressed = compressUsingDict(cctxHandle, jsonBytes, dictBytes, ZSTD_LEVEL);
       // Server protocol: 0xC7 + dict_id u16 BE (high=0x00 since IDs are 0x01–0x03) + frame
-      const out = new Uint8Array(3 + compressed.length);
+      const out = new Uint8Array(3 - compressed.length);
       out[0] = ZSTD_DICT_MAGIC_PREFIX;
       out[1] = (dictId >> 8) & 0xff; // high byte (0x00 for current IDs)
killedBy: encodeHttpBody / decodeHttpBody round-trips 0xC7 with ru dict: encode → frame[0]=0xC7, frame[2]=0x01 → decode → original
statusReason: Invalid typed array length: -61

[Killed] ArithmeticOperator
src/codec.ts:764:30
     // Dict not loaded — fall through to dictless.
   }
   const compressed = zstdCompress(jsonBytes, ZSTD_LEVEL);
-  const out = new Uint8Array(1 + compressed.length);
+  const out = new Uint8Array(1 - compressed.length);
   out[0] = ZSTD_MAGIC_PREFIX;
   out.set(compressed, 1);
killedBy: encodeHttpBody / decodeHttpBody round-trips 0xC6 dictless: encode → frame[0]=0xC6 → decode → original
statusReason: Invalid typed array length: -55

[Killed] EqualityOperator
src/codec.ts:791:7
   if (typeof bytes === 'string') {
     return JSON.parse(bytes) as unknown;
   }
-  if (bytes.length === 0) {
+  if (bytes.length !== 0) {
     throw new WireCodecError("EMPTY_INPUT", "wire-codec.decodeHttpBody: empty input");
   }
killedBy: decodeHttpBody — EMPTY_INPUT throws WireCodecError with code EMPTY_INPUT on empty Uint8Array
statusReason: expected error to be instance of WireCodecError

[Killed] BlockStatement
src/codec.ts:791:27
   if (typeof bytes === 'string') {
     return JSON.parse(bytes) as unknown;
   }
-  if (bytes.length === 0) {
-    throw new WireCodecError("EMPTY_INPUT", "wire-codec.decodeHttpBody: empty input");
-  }
+  if (bytes.length === 0) {}
   const first = bytes[0]!;  // length > 0 guard above
   if (first === JSON_OPEN_BRACE || first === JSON_OPEN_BRACKET) {
killedBy: decodeHttpBody — EMPTY_INPUT throws WireCodecError with code EMPTY_INPUT on empty Uint8Array
statusReason: expected error to be instance of WireCodecError

[Survived] StringLiteral
src/codec.ts:792:45
     return JSON.parse(bytes) as unknown;
   }
   if (bytes.length === 0) {
-    throw new WireCodecError("EMPTY_INPUT", "wire-codec.decodeHttpBody: empty input");
+    throw new WireCodecError("EMPTY_INPUT", "");
   }
   const first = bytes[0]!;  // length > 0 guard above

[Killed] BlockStatement
src/codec.ts:795:65
     throw new WireCodecError("EMPTY_INPUT", "wire-codec.decodeHttpBody: empty input");
   }
   const first = bytes[0]!;  // length > 0 guard above
-  if (first === JSON_OPEN_BRACE || first === JSON_OPEN_BRACKET) {
-    return JSON.parse(dec.decode(bytes)) as unknown;
-  }
+  if (first === JSON_OPEN_BRACE || first === JSON_OPEN_BRACKET) {}
   if (first === ZSTD_MAGIC_PREFIX) {
     if (!zstdReady) {
killedBy: encodeHttpBody / decodeHttpBody round-trips plain JSON bytes (0x7B prefix)
statusReason: wire-codec.decodeHttpBody: unknown magic byte 0x7b

[Killed] ConditionalExpression
src/codec.ts:795:7
     throw new WireCodecError("EMPTY_INPUT", "wire-codec.decodeHttpBody: empty input");
   }
   const first = bytes[0]!;  // length > 0 guard above
-  if (first === JSON_OPEN_BRACE || first === JSON_OPEN_BRACKET) {
+  if (false || first === JSON_OPEN_BRACKET) {
     return JSON.parse(dec.decode(bytes)) as unknown;
   }
killedBy: encodeHttpBody / decodeHttpBody round-trips plain JSON bytes (0x7B prefix)
statusReason: wire-codec.decodeHttpBody: unknown magic byte 0x7b

[Killed] BlockStatement
src/codec.ts:798:36
   if (first === JSON_OPEN_BRACE || first === JSON_OPEN_BRACKET) {
     return JSON.parse(dec.decode(bytes)) as unknown;
   }
-  if (first === ZSTD_MAGIC_PREFIX) {
-    if (!zstdReady) {
-      throw new WireCodecError(
-        "ZSTD_NOT_INITIALIZED",
-        "wire-codec.decodeHttpBody: zstd not initialized",
-      );
-    }
-    if (bytes.length - 1 > ZSTD_MAX_COMPRESSED_BYTES) {
-      throw new WireCodecError(
-        "COMPRESSED_TOO_LARGE",
-        "wire-codec.decodeHttpBody: payload exceeds compressed-size cap",
-        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length - 1 },
-      );
-    }
-    const compressed = bytes.subarray(1);
-    validateZstdFrame(compressed, ZSTD_MAX_DECOMPRESSED_BYTES);
-    const jsonBytes = zstdDecompress(compressed, ZSTD_DECOMPRESS_OPTS);
-    return JSON.parse(dec.decode(jsonBytes)) as unknown;
-  }
+  if (first === ZSTD_MAGIC_PREFIX) {}
   if (first === ZSTD_DICT_MAGIC_PREFIX) {
     if (!zstdReady || dctxHandle === null) {
killedBy: encodeHttpBody / decodeHttpBody round-trips 0xC6 dictless: encode → frame[0]=0xC6 → decode → original
statusReason: wire-codec.decodeHttpBody: unknown magic byte 0xc6

[NoCoverage] BlockStatement
src/codec.ts:799:21
     return JSON.parse(dec.decode(bytes)) as unknown;
   }
   if (first === ZSTD_MAGIC_PREFIX) {
-    if (!zstdReady) {
-      throw new WireCodecError(
-        "ZSTD_NOT_INITIALIZED",
-        "wire-codec.decodeHttpBody: zstd not initialized",
-      );
-    }
+    if (!zstdReady) {}
     if (bytes.length - 1 > ZSTD_MAX_COMPRESSED_BYTES) {
       throw new WireCodecError(

[Killed] EqualityOperator
src/codec.ts:805:9
         "wire-codec.decodeHttpBody: zstd not initialized",
       );
     }
-    if (bytes.length - 1 > ZSTD_MAX_COMPRESSED_BYTES) {
+    if (bytes.length - 1 <= ZSTD_MAX_COMPRESSED_BYTES) {
       throw new WireCodecError(
         "COMPRESSED_TOO_LARGE",
killedBy: encodeHttpBody / decodeHttpBody round-trips 0xC6 dictless: encode → frame[0]=0xC6 → decode → original
statusReason: wire-codec.decodeHttpBody: payload exceeds compressed-size cap

[Survived] EqualityOperator
src/codec.ts:805:9
         "wire-codec.decodeHttpBody: zstd not initialized",
       );
     }
-    if (bytes.length - 1 > ZSTD_MAX_COMPRESSED_BYTES) {
+    if (bytes.length - 1 >= ZSTD_MAX_COMPRESSED_BYTES) {
       throw new WireCodecError(
         "COMPRESSED_TOO_LARGE",

[NoCoverage] StringLiteral
src/codec.ts:808:9
     if (bytes.length - 1 > ZSTD_MAX_COMPRESSED_BYTES) {
       throw new WireCodecError(
         "COMPRESSED_TOO_LARGE",
-        "wire-codec.decodeHttpBody: payload exceeds compressed-size cap",
+        "",
         { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length - 1 },
       );

[NoCoverage] ArithmeticOperator
src/codec.ts:809:51
       throw new WireCodecError(
         "COMPRESSED_TOO_LARGE",
         "wire-codec.decodeHttpBody: payload exceeds compressed-size cap",
-        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length - 1 },
+        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length + 1 },
       );
     }

[NoCoverage] StringLiteral
src/codec.ts:821:9
     if (!zstdReady || dctxHandle === null) {
       throw new WireCodecError(
         "ZSTD_NOT_INITIALIZED",
-        "wire-codec.decodeHttpBody: zstd not initialized",
+        "",
       );
     }

[Killed] EqualityOperator
src/codec.ts:824:9
         "wire-codec.decodeHttpBody: zstd not initialized",
       );
     }
-    if (bytes.length < 3) {
+    if (bytes.length >= 3) {
       throw new WireCodecError(
         "INVALID_DICT_ID_HEADER",
killedBy: encodeHttpBody / decodeHttpBody round-trips 0xC7 with ru dict: encode → frame[0]=0xC7, frame[2]=0x01 → decode → original
statusReason: wire-codec.decodeHttpBody: truncated dict frame (need 3 header bytes)

[Killed] BlockStatement
src/codec.ts:824:27
         "wire-codec.decodeHttpBody: zstd not initialized",
       );
     }
-    if (bytes.length < 3) {
-      throw new WireCodecError(
-        "INVALID_DICT_ID_HEADER",
-        "wire-codec.decodeHttpBody: truncated dict frame (need 3 header bytes)",
-        { frameLen: bytes.length },
-      );
-    }
+    if (bytes.length < 3) {}
     if (bytes.length - 3 > ZSTD_MAX_COMPRESSED_BYTES) {
       throw new WireCodecError(
killedBy: decodeHttpBody — paths requiring zstd init INVALID_DICT_ID_HEADER: truncated 0xC7 frame (< 3 bytes)
statusReason: expected 'UNKNOWN_DICT_ID' to be 'INVALID_DICT_ID_HEADER' // Object.is equality

[Killed] ObjectLiteral
src/codec.ts:828:9
       throw new WireCodecError(
         "INVALID_DICT_ID_HEADER",
         "wire-codec.decodeHttpBody: truncated dict frame (need 3 header bytes)",
-        { frameLen: bytes.length },
+        {},
       );
     }
killedBy: decodeHttpBody — paths requiring zstd init INVALID_DICT_ID_HEADER: truncated 0xC7 frame (< 3 bytes)
statusReason: expected undefined to be 2 // Object.is equality

[NoCoverage] ArithmeticOperator
src/codec.ts:835:51
       throw new WireCodecError(
         "COMPRESSED_TOO_LARGE",
         "wire-codec.decodeHttpBody: payload exceeds compressed-size cap",
-        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length - 3 },
+        { limit: ZSTD_MAX_COMPRESSED_BYTES, size: bytes.length + 3 },
       );
     }

[Killed] ConditionalExpression
src/codec.ts:860:7
     const jsonBytes = decompressUsingDict(dctxHandle, compressed, dictBytes, ZSTD_DECOMPRESS_OPTS);
     return JSON.parse(dec.decode(jsonBytes)) as unknown;
   }
-  if (first === ZSTD_V2_MAGIC_PREFIX) {
+  if (false) {
     throw new WireCodecError(
       "PEER_ENVELOPE_FORMAT",
killedBy: decodeHttpBody — PEER_ENVELOPE_FORMAT throws WireCodecError with code PEER_ENVELOPE_FORMAT for 0xC8 byte
statusReason: expected 'UNKNOWN_MAGIC' to be 'PEER_ENVELOPE_FORMAT' // Object.is equality

[Killed] BlockStatement
src/codec.ts:860:39
     const jsonBytes = decompressUsingDict(dctxHandle, compressed, dictBytes, ZSTD_DECOMPRESS_OPTS);
     return JSON.parse(dec.decode(jsonBytes)) as unknown;
   }
-  if (first === ZSTD_V2_MAGIC_PREFIX) {
-    throw new WireCodecError(
-      "PEER_ENVELOPE_FORMAT",
-      "wire-codec.decodeHttpBody: 0xC8 is the peer envelope-v2 format; use decode() instead.",
-    );
-  }
+  if (first === ZSTD_V2_MAGIC_PREFIX) {}
   throw new WireCodecError(
     "UNKNOWN_MAGIC",
killedBy: decodeHttpBody — PEER_ENVELOPE_FORMAT throws WireCodecError with code PEER_ENVELOPE_FORMAT for 0xC8 byte
statusReason: expected 'UNKNOWN_MAGIC' to be 'PEER_ENVELOPE_FORMAT' // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:886:7
   mine: readonly WireCap[],
   othersCaps: readonly (readonly WireCap[])[],
 ): 1 | 2 | 3 {
-  if (othersCaps.length === 0) return 1;
+  if (true) return 1;
   // v3: requires 'envelope-v3' in mine AND every peer.
   if (mine.includes("envelope-v3")) {
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) negotiateEnvelopeVersion: 2 only when every peer advertises envelope-v2
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:886:7
   mine: readonly WireCap[],
   othersCaps: readonly (readonly WireCap[])[],
 ): 1 | 2 | 3 {
-  if (othersCaps.length === 0) return 1;
+  if (false) return 1;
   // v3: requires 'envelope-v3' in mine AND every peer.
   if (mine.includes("envelope-v3")) {
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) negotiateEnvelopeVersion: 2 only when every peer advertises envelope-v2
statusReason: expected 3 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:888:7
 ): 1 | 2 | 3 {
   if (othersCaps.length === 0) return 1;
   // v3: requires 'envelope-v3' in mine AND every peer.
-  if (mine.includes("envelope-v3")) {
+  if (true) {
     if (othersCaps.every((peer) => peer.includes("envelope-v3" as WireCap))) return 3;
   }
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) negotiateEnvelopeVersion: 3 when all peers advertise envelope-v3, 2 when v2-only, 1 otherwise
statusReason: expected 3 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:888:7
 ): 1 | 2 | 3 {
   if (othersCaps.length === 0) return 1;
   // v3: requires 'envelope-v3' in mine AND every peer.
-  if (mine.includes("envelope-v3")) {
+  if (false) {
     if (othersCaps.every((peer) => peer.includes("envelope-v3" as WireCap))) return 3;
   }
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) negotiateEnvelopeVersion: 3 when all peers advertise envelope-v3, 2 when v2-only, 1 otherwise
statusReason: expected 2 to be 3 // Object.is equality

[Killed] ArrowFunction
src/codec.ts:889:26
   if (othersCaps.length === 0) return 1;
   // v3: requires 'envelope-v3' in mine AND every peer.
   if (mine.includes("envelope-v3")) {
-    if (othersCaps.every((peer) => peer.includes("envelope-v3" as WireCap))) return 3;
+    if (othersCaps.every(() => undefined)) return 3;
   }
   // v2: requires 'envelope-v2' in mine AND every peer.
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) negotiateEnvelopeVersion: 3 when all peers advertise envelope-v3, 2 when v2-only, 1 otherwise
statusReason: expected 2 to be 3 // Object.is equality

[Killed] MethodExpression
src/codec.ts:889:9
   if (othersCaps.length === 0) return 1;
   // v3: requires 'envelope-v3' in mine AND every peer.
   if (mine.includes("envelope-v3")) {
-    if (othersCaps.every((peer) => peer.includes("envelope-v3" as WireCap))) return 3;
+    if (othersCaps.some(peer => peer.includes("envelope-v3" as WireCap))) return 3;
   }
   // v2: requires 'envelope-v2' in mine AND every peer.
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) negotiateEnvelopeVersion: 3 when all peers advertise envelope-v3, 2 when v2-only, 1 otherwise
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BlockStatement
src/codec.ts:892:37
     if (othersCaps.every((peer) => peer.includes("envelope-v3" as WireCap))) return 3;
   }
   // v2: requires 'envelope-v2' in mine AND every peer.
-  if (mine.includes("envelope-v2")) {
-    if (othersCaps.every((peer) => peer.includes("envelope-v2" as WireCap))) return 2;
-  }
+  if (mine.includes("envelope-v2")) {}
   return 1;
 }
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) negotiateEnvelopeVersion: 2 only when every peer advertises envelope-v2
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:892:7
     if (othersCaps.every((peer) => peer.includes("envelope-v3" as WireCap))) return 3;
   }
   // v2: requires 'envelope-v2' in mine AND every peer.
-  if (mine.includes("envelope-v2")) {
+  if (true) {
     if (othersCaps.every((peer) => peer.includes("envelope-v2" as WireCap))) return 2;
   }
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) negotiateEnvelopeVersion: 2 only when every peer advertises envelope-v2
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/codec.ts:893:9
   }
   // v2: requires 'envelope-v2' in mine AND every peer.
   if (mine.includes("envelope-v2")) {
-    if (othersCaps.every((peer) => peer.includes("envelope-v2" as WireCap))) return 2;
+    if (false) return 2;
   }
   return 1;
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) negotiateEnvelopeVersion: 2 only when every peer advertises envelope-v2
statusReason: expected 1 to be 2 // Object.is equality

[Killed] MethodExpression
src/codec.ts:893:9
   }
   // v2: requires 'envelope-v2' in mine AND every peer.
   if (mine.includes("envelope-v2")) {
-    if (othersCaps.every((peer) => peer.includes("envelope-v2" as WireCap))) return 2;
+    if (othersCaps.some(peer => peer.includes("envelope-v2" as WireCap))) return 2;
   }
   return 1;
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) negotiateEnvelopeVersion: 2 only when every peer advertises envelope-v2
statusReason: expected 2 to be 1 // Object.is equality
