[Killed] BlockStatement
src/dicts.ts:79:64
  * started with the old loader discards its result rather than polluting the
  * new-loader cache.
  */
-export function setDictLoader(loader: DictLoader | null): void {
-  _loader = loader;
-  _loaderGeneration++;
-  dictCache.clear();
-  inFlight.clear();
-}
+export function setDictLoader(loader: DictLoader | null): void {}
 
 /**
killedBy: loadDict — LOADER_SWAPPED_MID_FETCH throws WireCodecError with code LOADER_SWAPPED_MID_FETCH when loader is swapped mid-fetch
statusReason: resolveDict is not a function

[Survived] UpdateOperator
src/dicts.ts:81:3
  */
 export function setDictLoader(loader: DictLoader | null): void {
   _loader = loader;
-  _loaderGeneration++;
+  _loaderGeneration--;
   dictCache.clear();
   inFlight.clear();

[Killed] BlockStatement
src/dicts.ts:93:55
  * Calling this evicts the existing dict cache so the new base URL takes effect
  * on the next loadDict() call.
  */
-export function setDictBaseUrl(baseUrl: string): void {
-  setDictLoader(async (name: DictName): Promise<Uint8Array> => {
-    const url = `${baseUrl}/${name}.zstd`;
-    const resp = await fetch(url);
-    if (!resp.ok) {
-      throw new WireCodecError(
-        "DICT_FETCH_FAILED",
-        `wire-dicts.loadDict: failed to fetch ${url} (${resp.status})`,
-      );
-    }
-    return new Uint8Array(await resp.arrayBuffer());
-  });
-}
+export function setDictBaseUrl(baseUrl: string): void {}
 
 // ---------------------------------------------------------------------------
killedBy: setDictBaseUrl builds the correct URL and calls fetch
statusReason: expected [ '/dicts/zstd-dict-ru-v1.zstd' ] to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/dicts.ts:97:19
   setDictLoader(async (name: DictName): Promise<Uint8Array> => {
     const url = `${baseUrl}/${name}.zstd`;
     const resp = await fetch(url);
-    if (!resp.ok) {
-      throw new WireCodecError(
-        "DICT_FETCH_FAILED",
-        `wire-dicts.loadDict: failed to fetch ${url} (${resp.status})`,
-      );
-    }
+    if (!resp.ok) {}
     return new Uint8Array(await resp.arrayBuffer());
   });
killedBy: setDictBaseUrl treats fetch non-ok status as a thrown error
statusReason: promise resolved "Uint8Array[]" instead of rejecting

[Killed] ConditionalExpression
src/dicts.ts:97:9
   setDictLoader(async (name: DictName): Promise<Uint8Array> => {
     const url = `${baseUrl}/${name}.zstd`;
     const resp = await fetch(url);
-    if (!resp.ok) {
+    if (true) {
       throw new WireCodecError(
         "DICT_FETCH_FAILED",
killedBy: setDictBaseUrl builds the correct URL and calls fetch
statusReason: wire-dicts.loadDict: failed to fetch https://cdn.example.com/assets/zstd-dict-ru-v1.zstd (200)

[Killed] StringLiteral
src/dicts.ts:100:9
     if (!resp.ok) {
       throw new WireCodecError(
         "DICT_FETCH_FAILED",
-        `wire-dicts.loadDict: failed to fetch ${url} (${resp.status})`,
+        ``,
       );
     }
killedBy: setDictBaseUrl treats fetch non-ok status as a thrown error
statusReason: expected [Function] to throw error including '404' but got ''

[Killed] StringLiteral
src/dicts.ts:156:34
         buf = await loaderAtStart(name);
       } else {
         // Default: fetch from /dicts/ — preserves existing web/ shim behaviour.
-        const resp = await fetch(`/dicts/${name}.zstd`);
+        const resp = await fetch(``);
         if (!resp.ok) {
           throw new WireCodecError(
killedBy: Phase 2.E.B — zstd dict negotiation + encoder falls back to 0xC6 when requested dict is not loaded
statusReason: Failed to parse URL from

[Killed] ConditionalExpression
src/dicts.ts:157:13
       } else {
         // Default: fetch from /dicts/ — preserves existing web/ shim behaviour.
         const resp = await fetch(`/dicts/${name}.zstd`);
-        if (!resp.ok) {
+        if (false) {
           throw new WireCodecError(
             "DICT_FETCH_FAILED",
killedBy: default loader (back-compat) back-compat: non-ok default fetch throws with the /dicts/ URL in message
statusReason: promise resolved "Uint8Array[]" instead of rejecting

[Killed] BooleanLiteral
src/dicts.ts:157:13
       } else {
         // Default: fetch from /dicts/ — preserves existing web/ shim behaviour.
         const resp = await fetch(`/dicts/${name}.zstd`);
-        if (!resp.ok) {
+        if (resp.ok) {
           throw new WireCodecError(
             "DICT_FETCH_FAILED",
killedBy: default loader (back-compat) hits /dicts/${name}.zstd when no loader is configured
statusReason: wire-dicts.loadDict: failed to fetch /dicts/zstd-dict-en-v1.zstd (200)

[Killed] BlockStatement
src/dicts.ts:167:52
       }
       // Guard: if the loader was swapped while we were awaiting, discard the
       // result — writing stale bytes into the new-loader cache would corrupt it.
-      if (_loaderGeneration !== generationAtStart) {
-        throw new WireCodecError(
-          "LOADER_SWAPPED_MID_FETCH",
-          "wire-dicts.loadDict: loader swapped during fetch — stale result discarded",
-        );
-      }
+      if (_loaderGeneration !== generationAtStart) {}
       dictCache.set(name, buf);
       return buf;
killedBy: loader swap during in-flight fetch discards stale bytes and returns new-loader bytes on retry
statusReason: promise resolved "Uint8Array[ 170, 170 ]" instead of rejecting

[Killed] EqualityOperator
src/dicts.ts:167:11
       }
       // Guard: if the loader was swapped while we were awaiting, discard the
       // result — writing stale bytes into the new-loader cache would corrupt it.
-      if (_loaderGeneration !== generationAtStart) {
+      if (_loaderGeneration === generationAtStart) {
         throw new WireCodecError(
           "LOADER_SWAPPED_MID_FETCH",
killedBy: setDictLoader is called with the requested name and its result is returned
statusReason: wire-dicts.loadDict: loader swapped during fetch — stale result discarded

[Killed] StringLiteral
src/dicts.ts:170:11
       if (_loaderGeneration !== generationAtStart) {
         throw new WireCodecError(
           "LOADER_SWAPPED_MID_FETCH",
-          "wire-dicts.loadDict: loader swapped during fetch — stale result discarded",
+          "",
         );
       }
killedBy: loader swap during in-flight fetch discards stale bytes and returns new-loader bytes on retry
statusReason: expected [Function] to throw error including 'loader swapped during fetch' but got ''

[Killed] BlockStatement
src/dicts.ts:175:15
       }
       dictCache.set(name, buf);
       return buf;
-    } finally {
-      inFlight.delete(name);
-    }
+    } finally {}
   })();
   inFlight.set(name, fetchOnce);
killedBy: Phase 2.E.B — zstd dict negotiation + encoder loadDict de-dupes concurrent fetches for the same dict (in-flight Promise)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/dicts.ts:191:60
 
 /** TEST-ONLY. Drops a single dict from the cache to exercise the encoder's
  *  fallback-to-0xC6 path. Never call from production code. */
-export function _evictDictForTesting(name: DictName): void {
-  dictCache.delete(name);
-}
+export function _evictDictForTesting(name: DictName): void {}
 
 /** Test-only helper (leading `_` per convention, NOT in public barrel).
killedBy: Phase 2.E.B — zstd dict negotiation + encoder falls back to 0xC6 when requested dict is not loaded
statusReason: expected 199 to be 198 // Object.is equality

[Killed] BlockStatement
src/dicts.ts:199:48
  *  Resets the loader to null (default fetch path) and clears the dict cache.
  *  Pair with setDictLoader() tests to avoid cross-test contamination of
  *  module-level state. Never call from production code. */
-export function _resetLoaderForTesting(): void {
-  _loader = null;
-  _loaderGeneration = 0;
-  dictCache.clear();
-  inFlight.clear();
-}
+export function _resetLoaderForTesting(): void {}
 
killedBy: default loader (back-compat) hits /dicts/${name}.zstd when no loader is configured
statusReason: expected [ Array(1) ] to deeply equal [ '/dicts/zstd-dict-en-v1.zstd' ]
