[Killed] EqualityOperator
src/envelope-v2.ts:86:31
 
 /** Parse a 36-char UUID string into 16 raw bytes. Returns null on malformed input. */
 export function uuidToBytes(s: string): Uint8Array | null {
-	if (typeof s !== "string" || s.length !== 36) return null;
+	if (typeof s !== "string" || s.length === 36) return null;
 	const hex = s.replace(/-/g, "");
 	if (hex.length !== 32) return null;
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected 198 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/envelope-v2.ts:86:6
 
 /** Parse a 36-char UUID string into 16 raw bytes. Returns null on malformed input. */
 export function uuidToBytes(s: string): Uint8Array | null {
-	if (typeof s !== "string" || s.length !== 36) return null;
+	if (true) return null;
 	const hex = s.replace(/-/g, "");
 	if (hex.length !== 32) return null;
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected 198 to be 200 // Object.is equality

[Killed] EqualityOperator
src/envelope-v2.ts:88:6
 export function uuidToBytes(s: string): Uint8Array | null {
 	if (typeof s !== "string" || s.length !== 36) return null;
 	const hex = s.replace(/-/g, "");
-	if (hex.length !== 32) return null;
+	if (hex.length === 32) return null;
 	const out = new Uint8Array(16);
 	for (let i = 0; i < 16; i++) {
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected 198 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/envelope-v2.ts:88:6
 export function uuidToBytes(s: string): Uint8Array | null {
 	if (typeof s !== "string" || s.length !== 36) return null;
 	const hex = s.replace(/-/g, "");
-	if (hex.length !== 32) return null;
+	if (true) return null;
 	const out = new Uint8Array(16);
 	for (let i = 0; i < 16; i++) {
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected 198 to be 200 // Object.is equality

[Killed] BlockStatement
src/envelope-v2.ts:90:31
 	const hex = s.replace(/-/g, "");
 	if (hex.length !== 32) return null;
 	const out = new Uint8Array(16);
-	for (let i = 0; i < 16; i++) {
-		const b = parseInt(hex.slice(i * 2, i * 2 + 2), 16);
-		if (Number.isNaN(b)) return null;
-		out[i] = b;
-	}
+	for (let i = 0; i < 16; i++) {}
 	return out;
 }
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected { v: 1, …(5) } to deeply equal { v: 1, …(5) }

[Killed] EqualityOperator
src/envelope-v2.ts:90:18
 	const hex = s.replace(/-/g, "");
 	if (hex.length !== 32) return null;
 	const out = new Uint8Array(16);
-	for (let i = 0; i < 16; i++) {
+	for (let i = 0; i >= 16; i++) {
 		const b = parseInt(hex.slice(i * 2, i * 2 + 2), 16);
 		if (Number.isNaN(b)) return null;
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected { v: 1, …(5) } to deeply equal { v: 1, …(5) }

[Killed] ArithmeticOperator
src/envelope-v2.ts:91:32
 	if (hex.length !== 32) return null;
 	const out = new Uint8Array(16);
 	for (let i = 0; i < 16; i++) {
-		const b = parseInt(hex.slice(i * 2, i * 2 + 2), 16);
+		const b = parseInt(hex.slice(i / 2, i * 2 + 2), 16);
 		if (Number.isNaN(b)) return null;
 		out[i] = b;
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected { v: 1, …(5) } to deeply equal { v: 1, …(5) }

[Killed] MethodExpression
src/envelope-v2.ts:91:22
 	if (hex.length !== 32) return null;
 	const out = new Uint8Array(16);
 	for (let i = 0; i < 16; i++) {
-		const b = parseInt(hex.slice(i * 2, i * 2 + 2), 16);
+		const b = parseInt(hex, 16);
 		if (Number.isNaN(b)) return null;
 		out[i] = b;
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected { v: 1, …(5) } to deeply equal { v: 1, …(5) }

[Killed] ConditionalExpression
src/envelope-v2.ts:92:7
 	const out = new Uint8Array(16);
 	for (let i = 0; i < 16; i++) {
 		const b = parseInt(hex.slice(i * 2, i * 2 + 2), 16);
-		if (Number.isNaN(b)) return null;
+		if (true) return null;
 		out[i] = b;
 	}
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected 198 to be 200 // Object.is equality

[Survived] ConditionalExpression
src/envelope-v2.ts:92:7
 	const out = new Uint8Array(16);
 	for (let i = 0; i < 16; i++) {
 		const b = parseInt(hex.slice(i * 2, i * 2 + 2), 16);
-		if (Number.isNaN(b)) return null;
+		if (false) return null;
 		out[i] = b;
 	}

[Killed] ConditionalExpression
src/envelope-v2.ts:100:6
 
 /** Format 16 raw bytes as a 36-char UUID string (8-4-4-4-12). */
 export function bytesToUuid(bytes: Uint8Array): string {
-	if (bytes.length !== 16) throw new Error("wire-envelope-v2: UUID must be 16 bytes");
+	if (true) throw new Error("wire-envelope-v2: UUID must be 16 bytes");
 	const hex: string[] = new Array(16);
 	for (let i = 0; i < 16; i++) hex[i] = bytes[i]!.toString(16).padStart(2, "0");
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: wire-envelope-v2: UUID must be 16 bytes

[Killed] EqualityOperator
src/envelope-v2.ts:100:6
 
 /** Format 16 raw bytes as a 36-char UUID string (8-4-4-4-12). */
 export function bytesToUuid(bytes: Uint8Array): string {
-	if (bytes.length !== 16) throw new Error("wire-envelope-v2: UUID must be 16 bytes");
+	if (bytes.length === 16) throw new Error("wire-envelope-v2: UUID must be 16 bytes");
 	const hex: string[] = new Array(16);
 	for (let i = 0; i < 16; i++) hex[i] = bytes[i]!.toString(16).padStart(2, "0");
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: wire-envelope-v2: UUID must be 16 bytes

[Killed] UpdateOperator
src/envelope-v2.ts:102:26
 export function bytesToUuid(bytes: Uint8Array): string {
 	if (bytes.length !== 16) throw new Error("wire-envelope-v2: UUID must be 16 bytes");
 	const hex: string[] = new Array(16);
-	for (let i = 0; i < 16; i++) hex[i] = bytes[i]!.toString(16).padStart(2, "0");
+	for (let i = 0; i < 16; i--) hex[i] = bytes[i]!.toString(16).padStart(2, "0");
 	return (
 		hex.slice(0, 4).join("") + "-" +
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: Cannot read properties of undefined (reading 'toString')

[Killed] ConditionalExpression
src/envelope-v2.ts:102:18
 export function bytesToUuid(bytes: Uint8Array): string {
 	if (bytes.length !== 16) throw new Error("wire-envelope-v2: UUID must be 16 bytes");
 	const hex: string[] = new Array(16);
-	for (let i = 0; i < 16; i++) hex[i] = bytes[i]!.toString(16).padStart(2, "0");
+	for (let i = 0; false; i++) hex[i] = bytes[i]!.toString(16).padStart(2, "0");
 	return (
 		hex.slice(0, 4).join("") + "-" +
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected { v: 1, id: '----', …(4) } to deeply equal { v: 1, …(5) }

[Killed] MethodExpression
src/envelope-v2.ts:104:3
 	const hex: string[] = new Array(16);
 	for (let i = 0; i < 16; i++) hex[i] = bytes[i]!.toString(16).padStart(2, "0");
 	return (
-		hex.slice(0, 4).join("") + "-" +
+		hex.join("") + "-" +
 		hex.slice(4, 6).join("") + "-" +
 		hex.slice(6, 8).join("") + "-" +
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected { v: 1, …(5) } to deeply equal { v: 1, …(5) }

[Killed] StringLiteral
src/envelope-v2.ts:104:24
 	const hex: string[] = new Array(16);
 	for (let i = 0; i < 16; i++) hex[i] = bytes[i]!.toString(16).padStart(2, "0");
 	return (
-		hex.slice(0, 4).join("") + "-" +
+		hex.slice(0, 4).join("Stryker was here!") + "-" +
 		hex.slice(4, 6).join("") + "-" +
 		hex.slice(6, 8).join("") + "-" +
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected { v: 1, …(5) } to deeply equal { v: 1, …(5) }

[Killed] MethodExpression
src/envelope-v2.ts:105:3
 	for (let i = 0; i < 16; i++) hex[i] = bytes[i]!.toString(16).padStart(2, "0");
 	return (
 		hex.slice(0, 4).join("") + "-" +
-		hex.slice(4, 6).join("") + "-" +
+		hex.join("") + "-" +
 		hex.slice(6, 8).join("") + "-" +
 		hex.slice(8, 10).join("") + "-" +
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected { v: 1, …(5) } to deeply equal { v: 1, …(5) }

[Killed] MethodExpression
src/envelope-v2.ts:106:3
 	return (
 		hex.slice(0, 4).join("") + "-" +
 		hex.slice(4, 6).join("") + "-" +
-		hex.slice(6, 8).join("") + "-" +
+		hex.join("") + "-" +
 		hex.slice(8, 10).join("") + "-" +
 		hex.slice(10, 16).join("")
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected { v: 1, …(5) } to deeply equal { v: 1, …(5) }

[Killed] MethodExpression
src/envelope-v2.ts:107:3
 		hex.slice(0, 4).join("") + "-" +
 		hex.slice(4, 6).join("") + "-" +
 		hex.slice(6, 8).join("") + "-" +
-		hex.slice(8, 10).join("") + "-" +
+		hex.join("") + "-" +
 		hex.slice(10, 16).join("")
 	);
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected { v: 1, …(5) } to deeply equal { v: 1, …(5) }

[Killed] StringLiteral
src/envelope-v2.ts:107:31
 		hex.slice(0, 4).join("") + "-" +
 		hex.slice(4, 6).join("") + "-" +
 		hex.slice(6, 8).join("") + "-" +
-		hex.slice(8, 10).join("") + "-" +
+		hex.slice(8, 10).join("") + "" +
 		hex.slice(10, 16).join("")
 	);
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected { v: 1, …(5) } to deeply equal { v: 1, …(5) }

[Killed] MethodExpression
src/envelope-v2.ts:108:3
 		hex.slice(4, 6).join("") + "-" +
 		hex.slice(6, 8).join("") + "-" +
 		hex.slice(8, 10).join("") + "-" +
-		hex.slice(10, 16).join("")
+		hex.join("")
 	);
 }
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected { v: 1, …(5) } to deeply equal { v: 1, …(5) }

[Killed] StringLiteral
src/envelope-v2.ts:108:26
 		hex.slice(4, 6).join("") + "-" +
 		hex.slice(6, 8).join("") + "-" +
 		hex.slice(8, 10).join("") + "-" +
-		hex.slice(10, 16).join("")
+		hex.slice(10, 16).join("Stryker was here!")
 	);
 }
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected { v: 1, …(5) } to deeply equal { v: 1, …(5) }

[Killed] BooleanLiteral
src/envelope-v2.ts:116:6
  *  Misses (unknown kind, bad UUID, ts out of uint32-since-EPOCH window) → caller
  *  falls back to v1 envelope for THIS frame. Opportunistic per-frame, no wire break. */
 export function canEncodeAsV2(value: unknown): value is Record<string, unknown> {
-	if (!value || typeof value !== "object") return false;
+	if (value || typeof value !== "object") return false;
 	const o = value as Record<string, unknown>;
 	if (typeof o.kind !== "string" || KIND_TO_BYTE[o.kind] === undefined) return false;
killedBy: envelope-v3 realistic bench (random hex pubkeys) v3 savings summary across all 5 random pubkeys (dictless, 2-char body)
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/envelope-v2.ts:116:16
  *  Misses (unknown kind, bad UUID, ts out of uint32-since-EPOCH window) → caller
  *  falls back to v1 envelope for THIS frame. Opportunistic per-frame, no wire break. */
 export function canEncodeAsV2(value: unknown): value is Record<string, unknown> {
-	if (!value || typeof value !== "object") return false;
+	if (!value || typeof value === "object") return false;
 	const o = value as Record<string, unknown>;
 	if (typeof o.kind !== "string" || KIND_TO_BYTE[o.kind] === undefined) return false;
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected 198 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/envelope-v2.ts:118:6
 export function canEncodeAsV2(value: unknown): value is Record<string, unknown> {
 	if (!value || typeof value !== "object") return false;
 	const o = value as Record<string, unknown>;
-	if (typeof o.kind !== "string" || KIND_TO_BYTE[o.kind] === undefined) return false;
+	if (false) return false;
 	if (typeof o.id !== "string" || uuidToBytes(o.id) === null) return false;
 	if (typeof o.ts !== "number" || !Number.isFinite(o.ts)) return false;
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) encoder falls back to v1 when value isn't v2-encodable
statusReason: wire-envelope-v2: cannot encode kind "future-kind" — not a known wire kind

[Killed] EqualityOperator
src/envelope-v2.ts:118:36
 export function canEncodeAsV2(value: unknown): value is Record<string, unknown> {
 	if (!value || typeof value !== "object") return false;
 	const o = value as Record<string, unknown>;
-	if (typeof o.kind !== "string" || KIND_TO_BYTE[o.kind] === undefined) return false;
+	if (typeof o.kind !== "string" || KIND_TO_BYTE[o.kind] !== undefined) return false;
 	if (typeof o.id !== "string" || uuidToBytes(o.id) === null) return false;
 	if (typeof o.ts !== "number" || !Number.isFinite(o.ts)) return false;
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected 198 to be 200 // Object.is equality

[Killed] EqualityOperator
src/envelope-v2.ts:119:34
 	if (!value || typeof value !== "object") return false;
 	const o = value as Record<string, unknown>;
 	if (typeof o.kind !== "string" || KIND_TO_BYTE[o.kind] === undefined) return false;
-	if (typeof o.id !== "string" || uuidToBytes(o.id) === null) return false;
+	if (typeof o.id !== "string" || uuidToBytes(o.id) !== null) return false;
 	if (typeof o.ts !== "number" || !Number.isFinite(o.ts)) return false;
 	const delta = o.ts - ROOM_EPOCH;
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected 198 to be 200 // Object.is equality

[Survived] ConditionalExpression
src/envelope-v2.ts:119:6
 	if (!value || typeof value !== "object") return false;
 	const o = value as Record<string, unknown>;
 	if (typeof o.kind !== "string" || KIND_TO_BYTE[o.kind] === undefined) return false;
-	if (typeof o.id !== "string" || uuidToBytes(o.id) === null) return false;
+	if (false) return false;
 	if (typeof o.ts !== "number" || !Number.isFinite(o.ts)) return false;
 	const delta = o.ts - ROOM_EPOCH;

[Killed] BooleanLiteral
src/envelope-v2.ts:120:34
 	const o = value as Record<string, unknown>;
 	if (typeof o.kind !== "string" || KIND_TO_BYTE[o.kind] === undefined) return false;
 	if (typeof o.id !== "string" || uuidToBytes(o.id) === null) return false;
-	if (typeof o.ts !== "number" || !Number.isFinite(o.ts)) return false;
+	if (typeof o.ts !== "number" || Number.isFinite(o.ts)) return false;
 	const delta = o.ts - ROOM_EPOCH;
 	if (delta < 0 || delta > 0xffff_ffff) return false;
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected 198 to be 200 // Object.is equality

[NoCoverage] BooleanLiteral
src/envelope-v2.ts:120:65
 	const o = value as Record<string, unknown>;
 	if (typeof o.kind !== "string" || KIND_TO_BYTE[o.kind] === undefined) return false;
 	if (typeof o.id !== "string" || uuidToBytes(o.id) === null) return false;
-	if (typeof o.ts !== "number" || !Number.isFinite(o.ts)) return false;
+	if (typeof o.ts !== "number" || !Number.isFinite(o.ts)) return true;
 	const delta = o.ts - ROOM_EPOCH;
 	if (delta < 0 || delta > 0xffff_ffff) return false;

[Killed] ArithmeticOperator
src/envelope-v2.ts:121:16
 	if (typeof o.kind !== "string" || KIND_TO_BYTE[o.kind] === undefined) return false;
 	if (typeof o.id !== "string" || uuidToBytes(o.id) === null) return false;
 	if (typeof o.ts !== "number" || !Number.isFinite(o.ts)) return false;
-	const delta = o.ts - ROOM_EPOCH;
+	const delta = o.ts + ROOM_EPOCH;
 	if (delta < 0 || delta > 0xffff_ffff) return false;
 	return true;
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected 198 to be 200 // Object.is equality

[Killed] EqualityOperator
src/envelope-v2.ts:122:6
 	if (typeof o.id !== "string" || uuidToBytes(o.id) === null) return false;
 	if (typeof o.ts !== "number" || !Number.isFinite(o.ts)) return false;
 	const delta = o.ts - ROOM_EPOCH;
-	if (delta < 0 || delta > 0xffff_ffff) return false;
+	if (delta >= 0 || delta > 0xffff_ffff) return false;
 	return true;
 }
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected 198 to be 200 // Object.is equality

[Killed] EqualityOperator
src/envelope-v2.ts:122:19
 	if (typeof o.id !== "string" || uuidToBytes(o.id) === null) return false;
 	if (typeof o.ts !== "number" || !Number.isFinite(o.ts)) return false;
 	const delta = o.ts - ROOM_EPOCH;
-	if (delta < 0 || delta > 0xffff_ffff) return false;
+	if (delta < 0 || delta <= 0xffff_ffff) return false;
 	return true;
 }
killedBy: envelope-v3 realistic bench (random hex pubkeys) v3 savings summary across all 5 random pubkeys (dictless, 2-char body)
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/envelope-v2.ts:123:9
 	if (typeof o.ts !== "number" || !Number.isFinite(o.ts)) return false;
 	const delta = o.ts - ROOM_EPOCH;
 	if (delta < 0 || delta > 0xffff_ffff) return false;
-	return true;
+	return false;
 }
 
killedBy: envelope-v3 realistic bench (random hex pubkeys) v3 savings summary across all 5 random pubkeys (dictless, 2-char body)
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/envelope-v2.ts:135:6
  */
 export function toV2(v1: Record<string, unknown>): Record<string, unknown> {
 	const kByte = KIND_TO_BYTE[v1.kind as string];
-	if (kByte === undefined) {
+	if (true) {
 		throw new Error(`wire-envelope-v2: cannot encode kind "${String(v1.kind)}" — not a known wire kind`);
 	}
killedBy: envelope-v3 realistic bench (random hex pubkeys) dictless v1 vs v2 vs v3 — 2 chars (ок)
statusReason: wire-envelope-v2: cannot encode kind "chat-msg" — not a known wire kind

[Killed] ConditionalExpression
src/envelope-v2.ts:135:6
  */
 export function toV2(v1: Record<string, unknown>): Record<string, unknown> {
 	const kByte = KIND_TO_BYTE[v1.kind as string];
-	if (kByte === undefined) {
+	if (false) {
 		throw new Error(`wire-envelope-v2: cannot encode kind "${String(v1.kind)}" — not a known wire kind`);
 	}
killedBy: toV2 — send-side rejection of chat-unknown-future toV2 throws at runtime when given kind=chat-unknown-future
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/envelope-v2.ts:143:11
 	delete out.kind;
 	out.v = 2;
 	out.id = idBytes;
-	out.ts = (v1.ts as number) - ROOM_EPOCH;
+	out.ts = (v1.ts as number) + ROOM_EPOCH;
 	out.k = kByte;
 	return out;
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: wire-envelope-v2: ts out of uint32 window

[Killed] EqualityOperator
src/envelope-v2.ts:162:40
 export function fromV2(v2: Record<string, unknown>): Record<string, unknown> {
 	const k = v2.k;
 	const idRaw = v2.id;
-	if (!(idRaw instanceof Uint8Array) || idRaw.length !== 16) {
+	if (!(idRaw instanceof Uint8Array) || idRaw.length === 16) {
 		throw new Error("wire-envelope-v2: id must be 16-byte Uint8Array");
 	}
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: wire-envelope-v2: id must be 16-byte Uint8Array

[Survived] ConditionalExpression
src/envelope-v2.ts:162:40
 export function fromV2(v2: Record<string, unknown>): Record<string, unknown> {
 	const k = v2.k;
 	const idRaw = v2.id;
-	if (!(idRaw instanceof Uint8Array) || idRaw.length !== 16) {
+	if (!(idRaw instanceof Uint8Array) || false) {
 		throw new Error("wire-envelope-v2: id must be 16-byte Uint8Array");
 	}

[Killed] EqualityOperator
src/envelope-v2.ts:166:66
 		throw new Error("wire-envelope-v2: id must be 16-byte Uint8Array");
 	}
 	const tsDelta = v2.ts;
-	if (typeof tsDelta !== "number" || !Number.isFinite(tsDelta) || tsDelta < 0 || tsDelta > 0xffff_ffff) {
+	if (typeof tsDelta !== "number" || !Number.isFinite(tsDelta) || tsDelta >= 0 || tsDelta > 0xffff_ffff) {
 		throw new Error("wire-envelope-v2: ts out of uint32 window");
 	}
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: wire-envelope-v2: ts out of uint32 window

[Killed] EqualityOperator
src/envelope-v2.ts:166:81
 		throw new Error("wire-envelope-v2: id must be 16-byte Uint8Array");
 	}
 	const tsDelta = v2.ts;
-	if (typeof tsDelta !== "number" || !Number.isFinite(tsDelta) || tsDelta < 0 || tsDelta > 0xffff_ffff) {
+	if (typeof tsDelta !== "number" || !Number.isFinite(tsDelta) || tsDelta < 0 || tsDelta <= 0xffff_ffff) {
 		throw new Error("wire-envelope-v2: ts out of uint32 window");
 	}
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: wire-envelope-v2: ts out of uint32 window

[Killed] ArithmeticOperator
src/envelope-v2.ts:173:11
 	delete out.k;
 	out.v = 1;
 	out.id = bytesToUuid(idRaw);
-	out.ts = tsDelta + ROOM_EPOCH;
+	out.ts = tsDelta - ROOM_EPOCH;
 
 	if (typeof k !== "number") {
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected { v: 1, …(5) } to deeply equal { v: 1, …(5) }

[Killed] EqualityOperator
src/envelope-v2.ts:183:6
 		// once T1's error-code union lands and avoids a cross-PR race.
 		throw new Error(`wire-envelope-v2: fromV2: missing or non-numeric kind byte (got ${typeof k})`);
 	}
-	if (BYTE_TO_KIND[k] === undefined) {
+	if (BYTE_TO_KIND[k] !== undefined) {
 		// Forward-compat: numeric k byte allocated in a future protocol version.
 		// Return sentinel so callers can log + drop without crashing.
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) roundtrip dictless (0xC8 0x00)
statusReason: expected { v: 1, …(6) } to deeply equal { v: 1, …(5) }

[Killed] ConditionalExpression
src/envelope-v2.ts:183:6
 		// once T1's error-code union lands and avoids a cross-PR race.
 		throw new Error(`wire-envelope-v2: fromV2: missing or non-numeric kind byte (got ${typeof k})`);
 	}
-	if (BYTE_TO_KIND[k] === undefined) {
+	if (false) {
 		// Forward-compat: numeric k byte allocated in a future protocol version.
 		// Return sentinel so callers can log + drop without crashing.
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) decoder of 0xC8 0x00 with unknown enum byte returns forward-compat sentinel
statusReason: expected undefined to be 'chat-unknown-future' // Object.is equality

[Killed] StringLiteral
src/envelope-v2.ts:186:14
 	if (BYTE_TO_KIND[k] === undefined) {
 		// Forward-compat: numeric k byte allocated in a future protocol version.
 		// Return sentinel so callers can log + drop without crashing.
-		out.kind = "chat-unknown-future";
+		out.kind = "";
 		out.raw = k;
 		return out;
killedBy: Phase 2.F.A — envelope-v2 (0xC8 magic, compact id/ts/k) decoder of 0xC8 0x00 with unknown enum byte returns forward-compat sentinel
statusReason: expected '' to be 'chat-unknown-future' // Object.is equality

[Killed] BooleanLiteral
src/envelope-v2.ts:225:36
 	value: unknown,
 	peerIndex: number,
 ): value is Record<string, unknown> {
-	if (!canEncodeAsV2(value)) return false;
+	if (!canEncodeAsV2(value)) return true;
 	if (!Number.isInteger(peerIndex) || peerIndex < 0 || peerIndex > 0xff) return false;
 	const o = value as Record<string, unknown>;
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) encoder falls back to v1 when kind is unknown
statusReason: wire-envelope-v3: cannot encode kind "future-kind" — not a known wire kind

[Killed] BooleanLiteral
src/envelope-v2.ts:225:6
 	value: unknown,
 	peerIndex: number,
 ): value is Record<string, unknown> {
-	if (!canEncodeAsV2(value)) return false;
+	if (canEncodeAsV2(value)) return false;
 	if (!Number.isInteger(peerIndex) || peerIndex < 0 || peerIndex > 0xff) return false;
 	const o = value as Record<string, unknown>;
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: expected 200 to be 202 // Object.is equality

[Killed] ConditionalExpression
src/envelope-v2.ts:226:55
 	peerIndex: number,
 ): value is Record<string, unknown> {
 	if (!canEncodeAsV2(value)) return false;
-	if (!Number.isInteger(peerIndex) || peerIndex < 0 || peerIndex > 0xff) return false;
+	if (!Number.isInteger(peerIndex) || peerIndex < 0 || false) return false;
 	const o = value as Record<string, unknown>;
 	if (typeof o.from !== "string" || o.from.length === 0) return false;
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) encoder falls back to v2 when peerIndex is out of uint8 range
statusReason: wire-envelope-v3: peerIndex must be uint8 (0..255), got 256

[Killed] EqualityOperator
src/envelope-v2.ts:226:55
 	peerIndex: number,
 ): value is Record<string, unknown> {
 	if (!canEncodeAsV2(value)) return false;
-	if (!Number.isInteger(peerIndex) || peerIndex < 0 || peerIndex > 0xff) return false;
+	if (!Number.isInteger(peerIndex) || peerIndex < 0 || peerIndex >= 0xff) return false;
 	const o = value as Record<string, unknown>;
 	if (typeof o.from !== "string" || o.from.length === 0) return false;
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) peerIndex=255 (max uint8) produces 0xCA, not fallback
statusReason: expected 200 to be 202 // Object.is equality

[Killed] EqualityOperator
src/envelope-v2.ts:228:36
 	if (!canEncodeAsV2(value)) return false;
 	if (!Number.isInteger(peerIndex) || peerIndex < 0 || peerIndex > 0xff) return false;
 	const o = value as Record<string, unknown>;
-	if (typeof o.from !== "string" || o.from.length === 0) return false;
+	if (typeof o.from !== "string" || o.from.length !== 0) return false;
 	return true;
 }
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: expected 200 to be 202 // Object.is equality

[Killed] ConditionalExpression
src/envelope-v2.ts:228:6
 	if (!canEncodeAsV2(value)) return false;
 	if (!Number.isInteger(peerIndex) || peerIndex < 0 || peerIndex > 0xff) return false;
 	const o = value as Record<string, unknown>;
-	if (typeof o.from !== "string" || o.from.length === 0) return false;
+	if (true) return false;
 	return true;
 }
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: expected 200 to be 202 // Object.is equality

[Killed] BooleanLiteral
src/envelope-v2.ts:229:9
 	if (!Number.isInteger(peerIndex) || peerIndex < 0 || peerIndex > 0xff) return false;
 	const o = value as Record<string, unknown>;
 	if (typeof o.from !== "string" || o.from.length === 0) return false;
-	return true;
+	return false;
 }
 
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: expected 200 to be 202 // Object.is equality

[Killed] EqualityOperator
src/envelope-v2.ts:248:55
 	v1: Record<string, unknown>,
 	peerIndex: number,
 ): Record<string, unknown> {
-	if (!Number.isInteger(peerIndex) || peerIndex < 0 || peerIndex > 0xff) {
+	if (!Number.isInteger(peerIndex) || peerIndex < 0 || peerIndex <= 0xff) {
 		throw new Error(`wire-envelope-v3: peerIndex must be uint8 (0..255), got ${peerIndex}`);
 	}
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: wire-envelope-v3: peerIndex must be uint8 (0..255), got 0

[Killed] EqualityOperator
src/envelope-v2.ts:248:55
 	v1: Record<string, unknown>,
 	peerIndex: number,
 ): Record<string, unknown> {
-	if (!Number.isInteger(peerIndex) || peerIndex < 0 || peerIndex > 0xff) {
+	if (!Number.isInteger(peerIndex) || peerIndex < 0 || peerIndex >= 0xff) {
 		throw new Error(`wire-envelope-v3: peerIndex must be uint8 (0..255), got ${peerIndex}`);
 	}
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) peerIndex=255 (max uint8) produces 0xCA, not fallback
statusReason: wire-envelope-v3: peerIndex must be uint8 (0..255), got 255

[Killed] EqualityOperator
src/envelope-v2.ts:252:6
 		throw new Error(`wire-envelope-v3: peerIndex must be uint8 (0..255), got ${peerIndex}`);
 	}
 	const kByte = KIND_TO_BYTE[v1.kind as string];
-	if (kByte === undefined) {
+	if (kByte !== undefined) {
 		throw new Error(`wire-envelope-v3: cannot encode kind "${String(v1.kind)}" — not a known wire kind`);
 	}
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: wire-envelope-v3: cannot encode kind "chat-msg" — not a known wire kind

[NoCoverage] StringLiteral
src/envelope-v2.ts:253:19
 	}
 	const kByte = KIND_TO_BYTE[v1.kind as string];
 	if (kByte === undefined) {
-		throw new Error(`wire-envelope-v3: cannot encode kind "${String(v1.kind)}" — not a known wire kind`);
+		throw new Error(``);
 	}
 	const idBytes = uuidToBytes(v1.id as string)!;
