[Killed] EqualityOperator
src/envelope-v2.ts:288:40
 	const k = v3.k;
 	const idRaw = v3.id;
 	const f = v3.f;
-	if (!(idRaw instanceof Uint8Array) || idRaw.length !== 16) {
+	if (!(idRaw instanceof Uint8Array) || idRaw.length === 16) {
 		throw new Error("wire-envelope-v3: id must be 16-byte Uint8Array");
 	}
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: wire-envelope-v3: id must be 16-byte Uint8Array

[Survived] ConditionalExpression
src/envelope-v2.ts:288:40
 	const k = v3.k;
 	const idRaw = v3.id;
 	const f = v3.f;
-	if (!(idRaw instanceof Uint8Array) || idRaw.length !== 16) {
+	if (!(idRaw instanceof Uint8Array) || false) {
 		throw new Error("wire-envelope-v3: id must be 16-byte Uint8Array");
 	}

[Killed] EqualityOperator
src/envelope-v2.ts:292:66
 		throw new Error("wire-envelope-v3: id must be 16-byte Uint8Array");
 	}
 	const tsDelta = v3.ts;
-	if (typeof tsDelta !== "number" || !Number.isFinite(tsDelta) || tsDelta < 0 || tsDelta > 0xffff_ffff) {
+	if (typeof tsDelta !== "number" || !Number.isFinite(tsDelta) || tsDelta <= 0 || tsDelta > 0xffff_ffff) {
 		throw new Error("wire-envelope-v3: ts out of uint32 window");
 	}
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) fromV3 with ts at uint32 boundary (0 delta) resolves correctly
statusReason: wire-envelope-v3: ts out of uint32 window

[Killed] BooleanLiteral
src/envelope-v2.ts:292:37
 		throw new Error("wire-envelope-v3: id must be 16-byte Uint8Array");
 	}
 	const tsDelta = v3.ts;
-	if (typeof tsDelta !== "number" || !Number.isFinite(tsDelta) || tsDelta < 0 || tsDelta > 0xffff_ffff) {
+	if (typeof tsDelta !== "number" || Number.isFinite(tsDelta) || tsDelta < 0 || tsDelta > 0xffff_ffff) {
 		throw new Error("wire-envelope-v3: ts out of uint32 window");
 	}
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: wire-envelope-v3: ts out of uint32 window

[NoCoverage] StringLiteral
src/envelope-v2.ts:293:19
 	}
 	const tsDelta = v3.ts;
 	if (typeof tsDelta !== "number" || !Number.isFinite(tsDelta) || tsDelta < 0 || tsDelta > 0xffff_ffff) {
-		throw new Error("wire-envelope-v3: ts out of uint32 window");
+		throw new Error("");
 	}
 	if (typeof f !== "number" || !Number.isInteger(f) || f < 0 || f > 0xff) {

[Killed] EqualityOperator
src/envelope-v2.ts:295:64
 	if (typeof tsDelta !== "number" || !Number.isFinite(tsDelta) || tsDelta < 0 || tsDelta > 0xffff_ffff) {
 		throw new Error("wire-envelope-v3: ts out of uint32 window");
 	}
-	if (typeof f !== "number" || !Number.isInteger(f) || f < 0 || f > 0xff) {
+	if (typeof f !== "number" || !Number.isInteger(f) || f < 0 || f <= 0xff) {
 		throw new Error(`wire-envelope-v3: f must be uint8 (0..255), got ${typeof f === "number" ? f : typeof f}`);
 	}
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: wire-envelope-v3: f must be uint8 (0..255), got 0

[Killed] BooleanLiteral
src/envelope-v2.ts:295:31
 	if (typeof tsDelta !== "number" || !Number.isFinite(tsDelta) || tsDelta < 0 || tsDelta > 0xffff_ffff) {
 		throw new Error("wire-envelope-v3: ts out of uint32 window");
 	}
-	if (typeof f !== "number" || !Number.isInteger(f) || f < 0 || f > 0xff) {
+	if (typeof f !== "number" || Number.isInteger(f) || f < 0 || f > 0xff) {
 		throw new Error(`wire-envelope-v3: f must be uint8 (0..255), got ${typeof f === "number" ? f : typeof f}`);
 	}
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: wire-envelope-v3: f must be uint8 (0..255), got 0

[NoCoverage] EqualityOperator
src/envelope-v2.ts:296:70
 		throw new Error("wire-envelope-v3: ts out of uint32 window");
 	}
 	if (typeof f !== "number" || !Number.isInteger(f) || f < 0 || f > 0xff) {
-		throw new Error(`wire-envelope-v3: f must be uint8 (0..255), got ${typeof f === "number" ? f : typeof f}`);
+		throw new Error(`wire-envelope-v3: f must be uint8 (0..255), got ${typeof f !== "number" ? f : typeof f}`);
 	}
 

[NoCoverage] ConditionalExpression
src/envelope-v2.ts:296:70
 		throw new Error("wire-envelope-v3: ts out of uint32 window");
 	}
 	if (typeof f !== "number" || !Number.isInteger(f) || f < 0 || f > 0xff) {
-		throw new Error(`wire-envelope-v3: f must be uint8 (0..255), got ${typeof f === "number" ? f : typeof f}`);
+		throw new Error(`wire-envelope-v3: f must be uint8 (0..255), got ${true ? f : typeof f}`);
 	}
 

[Killed] BlockStatement
src/envelope-v2.ts:310:33
 	// (peer not in map), leave `from` undefined + preserve `f` for caller
 	// diagnostics. The caller MUST handle `from === undefined` by dropping the
 	// frame (same as chat-unknown-future).
-	if (resolvePeer !== undefined) {
-		const pubkey = resolvePeer(f);
-		if (pubkey !== undefined) {
-			out.from = pubkey;
-		} else {
-			out.from = undefined;
-			out.f = f; // preserve for caller diagnostics
-		}
-	} else {
+	if (resolvePeer !== undefined) {} else {
 		out.from = undefined;
 		out.f = f; // preserve for caller diagnostics
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: expected undefined to be 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa…' // Object.is equality

[Killed] ConditionalExpression
src/envelope-v2.ts:312:7
 	// frame (same as chat-unknown-future).
 	if (resolvePeer !== undefined) {
 		const pubkey = resolvePeer(f);
-		if (pubkey !== undefined) {
+		if (false) {
 			out.from = pubkey;
 		} else {
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) roundtrip dictless (0xCA 0x00 <peerIndex>)
statusReason: expected undefined to be 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa…' // Object.is equality

[Killed] ConditionalExpression
src/envelope-v2.ts:312:7
 	// frame (same as chat-unknown-future).
 	if (resolvePeer !== undefined) {
 		const pubkey = resolvePeer(f);
-		if (pubkey !== undefined) {
+		if (true) {
 			out.from = pubkey;
 		} else {
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) decoder with resolvePeer returning undefined (peer not in map) → from=undefined + f preserved
statusReason: expected undefined to be 99 // Object.is equality

[Killed] BlockStatement
src/envelope-v2.ts:314:10
 		const pubkey = resolvePeer(f);
 		if (pubkey !== undefined) {
 			out.from = pubkey;
-		} else {
-			out.from = undefined;
-			out.f = f; // preserve for caller diagnostics
-		}
+		} else {}
 	} else {
 		out.from = undefined;
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) decoder with resolvePeer returning undefined (peer not in map) → from=undefined + f preserved
statusReason: expected undefined to be 99 // Object.is equality

[Killed] BlockStatement
src/envelope-v2.ts:318:9
 			out.from = undefined;
 			out.f = f; // preserve for caller diagnostics
 		}
-	} else {
-		out.from = undefined;
-		out.f = f; // preserve for caller diagnostics
-	}
+	} else {}
 
 	if (typeof k !== "number") {
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) decoder without resolvePeer returns from=undefined + preserves f
statusReason: expected undefined to be 42 // Object.is equality

[NoCoverage] StringLiteral
src/envelope-v2.ts:324:19
 	}
 
 	if (typeof k !== "number") {
-		throw new Error(`wire-envelope-v3: fromV3: missing or non-numeric kind byte (got ${typeof k})`);
+		throw new Error(``);
 	}
 	if (BYTE_TO_KIND[k] === undefined) {
