[Killed] StringLiteral
src/errors.ts:81:17
     details?: WireCodecErrorDetails,
   ) {
     super(message);
-    this.name = "WireCodecError";
+    this.name = "";
     this.code = code;
     this.details = details !== undefined ? Object.freeze({ ...details }) : undefined;
killedBy: WireCodecError class name is WireCodecError
statusReason: expected '' to be 'WireCodecError' // Object.is equality

[Killed] ConditionalExpression
src/errors.ts:83:20
     super(message);
     this.name = "WireCodecError";
     this.code = code;
-    this.details = details !== undefined ? Object.freeze({ ...details }) : undefined;
+    this.details = false ? Object.freeze({ ...details }) : undefined;
   }
 }
killedBy: WireCodecError class details is frozen when provided
statusReason: expected undefined to be 42 // Object.is equality

[Killed] ConditionalExpression
src/errors.ts:83:20
     super(message);
     this.name = "WireCodecError";
     this.code = code;
-    this.details = details !== undefined ? Object.freeze({ ...details }) : undefined;
+    this.details = true ? Object.freeze({ ...details }) : undefined;
   }
 }
killedBy: WireCodecError class details is undefined when omitted
statusReason: expected {} to be undefined
