[Killed] ConditionalExpression
src/mesh-bundle.ts:56:7
 
 export function encodeMeshBundle(args: MeshBundleEncodeArgs): Uint8Array {
   // Fixed-array field validation -- wrong lengths are data/key errors, not sig errors
-  if (args.senderPubkey.length !== 32) {
+  if (true) {
     throw new WireCodecError('MESH_BUNDLE_FIELD_INVALID', 'senderPubkey must be 32 bytes', {
       field: 'senderPubkey', length: args.senderPubkey.length, expected: 32,
killedBy: encodeMeshBundle produces a bundle with correct magic + version + header layout
statusReason: senderPubkey must be 32 bytes

[Killed] EqualityOperator
src/mesh-bundle.ts:56:7
 
 export function encodeMeshBundle(args: MeshBundleEncodeArgs): Uint8Array {
   // Fixed-array field validation -- wrong lengths are data/key errors, not sig errors
-  if (args.senderPubkey.length !== 32) {
+  if (args.senderPubkey.length === 32) {
     throw new WireCodecError('MESH_BUNDLE_FIELD_INVALID', 'senderPubkey must be 32 bytes', {
       field: 'senderPubkey', length: args.senderPubkey.length, expected: 32,
killedBy: encodeMeshBundle produces a bundle with correct magic + version + header layout
statusReason: senderPubkey must be 32 bytes

[Survived] StringLiteral
src/mesh-bundle.ts:57:59
 export function encodeMeshBundle(args: MeshBundleEncodeArgs): Uint8Array {
   // Fixed-array field validation -- wrong lengths are data/key errors, not sig errors
   if (args.senderPubkey.length !== 32) {
-    throw new WireCodecError('MESH_BUNDLE_FIELD_INVALID', 'senderPubkey must be 32 bytes', {
+    throw new WireCodecError('MESH_BUNDLE_FIELD_INVALID', "", {
       field: 'senderPubkey', length: args.senderPubkey.length, expected: 32,
     });

[Killed] EqualityOperator
src/mesh-bundle.ts:61:7
       field: 'senderPubkey', length: args.senderPubkey.length, expected: 32,
     });
   }
-  if (args.msgId.length !== 16) {
+  if (args.msgId.length === 16) {
     throw new WireCodecError('MESH_BUNDLE_FIELD_INVALID', 'msgId must be 16 bytes', {
       field: 'msgId', length: args.msgId.length, expected: 16,
killedBy: encodeMeshBundle produces a bundle with correct magic + version + header layout
statusReason: msgId must be 16 bytes

[Killed] ConditionalExpression
src/mesh-bundle.ts:61:7
       field: 'senderPubkey', length: args.senderPubkey.length, expected: 32,
     });
   }
-  if (args.msgId.length !== 16) {
+  if (false) {
     throw new WireCodecError('MESH_BUNDLE_FIELD_INVALID', 'msgId must be 16 bytes', {
       field: 'msgId', length: args.msgId.length, expected: 16,
killedBy: encodeMeshBundle rejects msgId with wrong length using MESH_BUNDLE_FIELD_INVALID
statusReason: expected function to throw an error, but it didn't

[Survived] ObjectLiteral
src/mesh-bundle.ts:62:85
     });
   }
   if (args.msgId.length !== 16) {
-    throw new WireCodecError('MESH_BUNDLE_FIELD_INVALID', 'msgId must be 16 bytes', {
-      field: 'msgId', length: args.msgId.length, expected: 16,
-    });
+    throw new WireCodecError('MESH_BUNDLE_FIELD_INVALID', 'msgId must be 16 bytes', {});
   }
   if (args.channelIdHash.length !== 4) {

[Survived] StringLiteral
src/mesh-bundle.ts:62:59
     });
   }
   if (args.msgId.length !== 16) {
-    throw new WireCodecError('MESH_BUNDLE_FIELD_INVALID', 'msgId must be 16 bytes', {
+    throw new WireCodecError('MESH_BUNDLE_FIELD_INVALID', "", {
       field: 'msgId', length: args.msgId.length, expected: 16,
     });

[Killed] EqualityOperator
src/mesh-bundle.ts:66:7
       field: 'msgId', length: args.msgId.length, expected: 16,
     });
   }
-  if (args.channelIdHash.length !== 4) {
+  if (args.channelIdHash.length === 4) {
     throw new WireCodecError('MESH_BUNDLE_FIELD_INVALID', 'channelIdHash must be 4 bytes', {
       field: 'channelIdHash', length: args.channelIdHash.length, expected: 4,
killedBy: encodeMeshBundle produces a bundle with correct magic + version + header layout
statusReason: channelIdHash must be 4 bytes

[Killed] ConditionalExpression
src/mesh-bundle.ts:66:7
       field: 'msgId', length: args.msgId.length, expected: 16,
     });
   }
-  if (args.channelIdHash.length !== 4) {
+  if (true) {
     throw new WireCodecError('MESH_BUNDLE_FIELD_INVALID', 'channelIdHash must be 4 bytes', {
       field: 'channelIdHash', length: args.channelIdHash.length, expected: 4,
killedBy: encodeMeshBundle produces a bundle with correct magic + version + header layout
statusReason: channelIdHash must be 4 bytes

[Survived] ObjectLiteral
src/mesh-bundle.ts:67:92
     });
   }
   if (args.channelIdHash.length !== 4) {
-    throw new WireCodecError('MESH_BUNDLE_FIELD_INVALID', 'channelIdHash must be 4 bytes', {
-      field: 'channelIdHash', length: args.channelIdHash.length, expected: 4,
-    });
+    throw new WireCodecError('MESH_BUNDLE_FIELD_INVALID', 'channelIdHash must be 4 bytes', {});
   }
   // Signature wrong length is a sig error (caller passed a bad signature)

[Survived] StringLiteral
src/mesh-bundle.ts:67:59
     });
   }
   if (args.channelIdHash.length !== 4) {
-    throw new WireCodecError('MESH_BUNDLE_FIELD_INVALID', 'channelIdHash must be 4 bytes', {
+    throw new WireCodecError('MESH_BUNDLE_FIELD_INVALID', "", {
       field: 'channelIdHash', length: args.channelIdHash.length, expected: 4,
     });

[Killed] ConditionalExpression
src/mesh-bundle.ts:72:7
     });
   }
   // Signature wrong length is a sig error (caller passed a bad signature)
-  if (args.signature.length !== MESH_BUNDLE_SIG_LEN) {
+  if (true) {
     throw new WireCodecError('MESH_BUNDLE_SIG_INVALID', 'signature must be 64 bytes', {
       length: args.signature.length,
killedBy: encodeMeshBundle produces a bundle with correct magic + version + header layout
statusReason: signature must be 64 bytes

[Killed] BlockStatement
src/mesh-bundle.ts:72:54
     });
   }
   // Signature wrong length is a sig error (caller passed a bad signature)
-  if (args.signature.length !== MESH_BUNDLE_SIG_LEN) {
-    throw new WireCodecError('MESH_BUNDLE_SIG_INVALID', 'signature must be 64 bytes', {
-      length: args.signature.length,
-    });
-  }
+  if (args.signature.length !== MESH_BUNDLE_SIG_LEN) {}
   // Numeric field validation -- must be integers in their wire ranges
   if (!Number.isInteger(args.tsSecOffset) || args.tsSecOffset < 0 || args.tsSecOffset > 0xffffffff) {
killedBy: encodeMeshBundle signature wrong length still uses MESH_BUNDLE_SIG_INVALID
statusReason: expected function to throw an error, but it didn't

[Survived] StringLiteral
src/mesh-bundle.ts:73:57
   }
   // Signature wrong length is a sig error (caller passed a bad signature)
   if (args.signature.length !== MESH_BUNDLE_SIG_LEN) {
-    throw new WireCodecError('MESH_BUNDLE_SIG_INVALID', 'signature must be 64 bytes', {
+    throw new WireCodecError('MESH_BUNDLE_SIG_INVALID', "", {
       length: args.signature.length,
     });

[Killed] ConditionalExpression
src/mesh-bundle.ts:78:46
     });
   }
   // Numeric field validation -- must be integers in their wire ranges
-  if (!Number.isInteger(args.tsSecOffset) || args.tsSecOffset < 0 || args.tsSecOffset > 0xffffffff) {
+  if (!Number.isInteger(args.tsSecOffset) || false || args.tsSecOffset > 0xffffffff) {
     throw new WireCodecError(
       'MESH_BUNDLE_FIELD_INVALID',
killedBy: encodeMeshBundle rejects tsSecOffset that is negative (-1)
statusReason: expected function to throw an error, but it didn't

[Killed] LogicalOperator
src/mesh-bundle.ts:78:7
     });
   }
   // Numeric field validation -- must be integers in their wire ranges
-  if (!Number.isInteger(args.tsSecOffset) || args.tsSecOffset < 0 || args.tsSecOffset > 0xffffffff) {
+  if ((!Number.isInteger(args.tsSecOffset) || args.tsSecOffset < 0) && args.tsSecOffset > 0xffffffff) {
     throw new WireCodecError(
       'MESH_BUNDLE_FIELD_INVALID',
killedBy: encodeMeshBundle rejects tsSecOffset that is a float (0.5)
statusReason: expected function to throw an error, but it didn't

[Killed] LogicalOperator
src/mesh-bundle.ts:85:7
       { field: 'tsSecOffset', value: args.tsSecOffset },
     );
   }
-  if (!Number.isInteger(args.ttlHops) || args.ttlHops < 0 || args.ttlHops > 255) {
+  if ((!Number.isInteger(args.ttlHops) || args.ttlHops < 0) && args.ttlHops > 255) {
     throw new WireCodecError(
       'MESH_BUNDLE_FIELD_INVALID',
killedBy: encodeMeshBundle rejects ttlHops > 255 (256)
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/mesh-bundle.ts:85:82
       { field: 'tsSecOffset', value: args.tsSecOffset },
     );
   }
-  if (!Number.isInteger(args.ttlHops) || args.ttlHops < 0 || args.ttlHops > 255) {
-    throw new WireCodecError(
-      'MESH_BUNDLE_FIELD_INVALID',
-      'ttlHops must be an integer in [0, 255]',
-      { field: 'ttlHops', value: args.ttlHops },
-    );
-  }
+  if (!Number.isInteger(args.ttlHops) || args.ttlHops < 0 || args.ttlHops > 255) {}
   if (args.body.length > MESH_BUNDLE_MAX_BODY) {
     throw new WireCodecError(
killedBy: encodeMeshBundle rejects ttlHops > 255 (256)
statusReason: expected function to throw an error, but it didn't

[Survived] StringLiteral
src/mesh-bundle.ts:89:16
     throw new WireCodecError(
       'MESH_BUNDLE_FIELD_INVALID',
       'ttlHops must be an integer in [0, 255]',
-      { field: 'ttlHops', value: args.ttlHops },
+      { field: "", value: args.ttlHops },
     );
   }

[Killed] BlockStatement
src/mesh-bundle.ts:92:48
       { field: 'ttlHops', value: args.ttlHops },
     );
   }
-  if (args.body.length > MESH_BUNDLE_MAX_BODY) {
-    throw new WireCodecError(
-      'MESH_BUNDLE_TOO_LARGE',
-      ` body exceeds ` + MESH_BUNDLE_MAX_BODY + ` B cap`,
-      { size: args.body.length, cap: MESH_BUNDLE_MAX_BODY },
-    );
-  }
+  if (args.body.length > MESH_BUNDLE_MAX_BODY) {}
 
   const total = MESH_BUNDLE_HEADER_FIXED_LEN + args.body.length + MESH_BUNDLE_SIG_LEN;
killedBy: encodeMeshBundle rejects body exceeding 1500 B cap with MESH_BUNDLE_TOO_LARGE
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/mesh-bundle.ts:92:7
       { field: 'ttlHops', value: args.ttlHops },
     );
   }
-  if (args.body.length > MESH_BUNDLE_MAX_BODY) {
+  if (false) {
     throw new WireCodecError(
       'MESH_BUNDLE_TOO_LARGE',
killedBy: encodeMeshBundle rejects body exceeding 1500 B cap with MESH_BUNDLE_TOO_LARGE
statusReason: expected function to throw an error, but it didn't

[Killed] ArithmeticOperator
src/mesh-bundle.ts:100:17
     );
   }
 
-  const total = MESH_BUNDLE_HEADER_FIXED_LEN + args.body.length + MESH_BUNDLE_SIG_LEN;
+  const total = MESH_BUNDLE_HEADER_FIXED_LEN + args.body.length - MESH_BUNDLE_SIG_LEN;
   const out = new Uint8Array(total);
   out[0] = MESH_BUNDLE_MAGIC_V1;
killedBy: encodeMeshBundle produces a bundle with correct magic + version + header layout
statusReason: offset is out of bounds

[Killed] ArithmeticOperator
src/mesh-bundle.ts:100:17
     );
   }
 
-  const total = MESH_BUNDLE_HEADER_FIXED_LEN + args.body.length + MESH_BUNDLE_SIG_LEN;
+  const total = MESH_BUNDLE_HEADER_FIXED_LEN - args.body.length + MESH_BUNDLE_SIG_LEN;
   const out = new Uint8Array(total);
   out[0] = MESH_BUNDLE_MAGIC_V1;
killedBy: encodeMeshBundle produces a bundle with correct magic + version + header layout
statusReason: offset is out of bounds

[Killed] ArithmeticOperator
src/mesh-bundle.ts:117:27
   out[59] = (args.body.length >>> 8) & 0xff;
   out[60] = args.body.length & 0xff;
   out.set(args.body, MESH_BUNDLE_HEADER_FIXED_LEN);
-  out.set(args.signature, MESH_BUNDLE_HEADER_FIXED_LEN + args.body.length);
+  out.set(args.signature, MESH_BUNDLE_HEADER_FIXED_LEN - args.body.length);
   return out;
 }
killedBy: encodeMeshBundle produces a bundle with correct magic + version + header layout
statusReason: expected [ 204, 204, 204, 204, 204, 204, …(58) ] to deeply equal [ 204, 204, 204, 204, 204, 204, …(58) ]

[Killed] ArithmeticOperator
src/mesh-bundle.ts:123:21
 
 export function decodeMeshBundle(wire: Uint8Array): MeshBundleDecoded {
   // Must be at least 125 B: 61 B header + 0 B body + 64 B sig
-  if (wire.length < MESH_BUNDLE_HEADER_FIXED_LEN + MESH_BUNDLE_SIG_LEN) {
+  if (wire.length < MESH_BUNDLE_HEADER_FIXED_LEN - MESH_BUNDLE_SIG_LEN) {
     throw new WireCodecError('MESH_BUNDLE_TRUNCATED', 'bundle below minimum size', {
       size: wire.length,
killedBy: decodeMeshBundle rejects bundle smaller than 125 B minimum (61 header + 0 body + 64 sig)
statusReason: expected error to match asymmetric matcher

[Killed] BlockStatement
src/mesh-bundle.ts:123:73
 
 export function decodeMeshBundle(wire: Uint8Array): MeshBundleDecoded {
   // Must be at least 125 B: 61 B header + 0 B body + 64 B sig
-  if (wire.length < MESH_BUNDLE_HEADER_FIXED_LEN + MESH_BUNDLE_SIG_LEN) {
-    throw new WireCodecError('MESH_BUNDLE_TRUNCATED', 'bundle below minimum size', {
-      size: wire.length,
-      min: MESH_BUNDLE_HEADER_FIXED_LEN + MESH_BUNDLE_SIG_LEN,
-    });
-  }
+  if (wire.length < MESH_BUNDLE_HEADER_FIXED_LEN + MESH_BUNDLE_SIG_LEN) {}
   if (wire[0] !== MESH_BUNDLE_MAGIC_V1) {
     throw new WireCodecError('UNKNOWN_MAGIC', 'mesh-bundle magic byte mismatch', {
killedBy: decodeMeshBundle rejects bundle smaller than 125 B minimum (61 header + 0 body + 64 sig)
statusReason: expected error to match asymmetric matcher

[Survived] ObjectLiteral
src/mesh-bundle.ts:124:84
 export function decodeMeshBundle(wire: Uint8Array): MeshBundleDecoded {
   // Must be at least 125 B: 61 B header + 0 B body + 64 B sig
   if (wire.length < MESH_BUNDLE_HEADER_FIXED_LEN + MESH_BUNDLE_SIG_LEN) {
-    throw new WireCodecError('MESH_BUNDLE_TRUNCATED', 'bundle below minimum size', {
-      size: wire.length,
-      min: MESH_BUNDLE_HEADER_FIXED_LEN + MESH_BUNDLE_SIG_LEN,
-    });
+    throw new WireCodecError('MESH_BUNDLE_TRUNCATED', 'bundle below minimum size', {});
   }
   if (wire[0] !== MESH_BUNDLE_MAGIC_V1) {

[Survived] ArithmeticOperator
src/mesh-bundle.ts:126:12
   if (wire.length < MESH_BUNDLE_HEADER_FIXED_LEN + MESH_BUNDLE_SIG_LEN) {
     throw new WireCodecError('MESH_BUNDLE_TRUNCATED', 'bundle below minimum size', {
       size: wire.length,
-      min: MESH_BUNDLE_HEADER_FIXED_LEN + MESH_BUNDLE_SIG_LEN,
+      min: MESH_BUNDLE_HEADER_FIXED_LEN - MESH_BUNDLE_SIG_LEN,
     });
   }

[Killed] ConditionalExpression
src/mesh-bundle.ts:129:7
       min: MESH_BUNDLE_HEADER_FIXED_LEN + MESH_BUNDLE_SIG_LEN,
     });
   }
-  if (wire[0] !== MESH_BUNDLE_MAGIC_V1) {
+  if (false) {
     throw new WireCodecError('UNKNOWN_MAGIC', 'mesh-bundle magic byte mismatch', {
       magic: wire[0]!,
killedBy: decodeMeshBundle rejects wrong magic byte
statusReason: expected error to match asymmetric matcher

[Killed] ConditionalExpression
src/mesh-bundle.ts:129:7
       min: MESH_BUNDLE_HEADER_FIXED_LEN + MESH_BUNDLE_SIG_LEN,
     });
   }
-  if (wire[0] !== MESH_BUNDLE_MAGIC_V1) {
+  if (true) {
     throw new WireCodecError('UNKNOWN_MAGIC', 'mesh-bundle magic byte mismatch', {
       magic: wire[0]!,
killedBy: encodeMeshBundle round-trips boundary tsSecOffset=0 and ttlHops=0
statusReason: mesh-bundle magic byte mismatch

[Survived] StringLiteral
src/mesh-bundle.ts:130:47
     });
   }
   if (wire[0] !== MESH_BUNDLE_MAGIC_V1) {
-    throw new WireCodecError('UNKNOWN_MAGIC', 'mesh-bundle magic byte mismatch', {
+    throw new WireCodecError('UNKNOWN_MAGIC', "", {
       magic: wire[0]!,
     });

[Killed] BlockStatement
src/mesh-bundle.ts:134:40
       magic: wire[0]!,
     });
   }
-  if (wire[1] !== MESH_BUNDLE_VERSION) {
-    throw new WireCodecError('MESH_BUNDLE_VERSION_UNSUPPORTED', 'mesh-bundle version not supported', {
-      version: wire[1]!,
-      supported: MESH_BUNDLE_VERSION,
-    });
-  }
+  if (wire[1] !== MESH_BUNDLE_VERSION) {}
   const bodyLen = (wire[59]! << 8) | wire[60]!;
   if (bodyLen > MESH_BUNDLE_MAX_BODY) {
killedBy: decodeMeshBundle rejects wrong version byte with MESH_BUNDLE_VERSION_UNSUPPORTED
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/mesh-bundle.ts:134:7
       magic: wire[0]!,
     });
   }
-  if (wire[1] !== MESH_BUNDLE_VERSION) {
+  if (wire[1] === MESH_BUNDLE_VERSION) {
     throw new WireCodecError('MESH_BUNDLE_VERSION_UNSUPPORTED', 'mesh-bundle version not supported', {
       version: wire[1]!,
killedBy: encodeMeshBundle round-trips boundary tsSecOffset=0 and ttlHops=0
statusReason: mesh-bundle version not supported

[Killed] ConditionalExpression
src/mesh-bundle.ts:141:7
     });
   }
   const bodyLen = (wire[59]! << 8) | wire[60]!;
-  if (bodyLen > MESH_BUNDLE_MAX_BODY) {
+  if (true) {
     // Cap violation -- body_len in header exceeds protocol maximum
     throw new WireCodecError('MESH_BUNDLE_TOO_LARGE', 'body_len exceeds cap', {
killedBy: encodeMeshBundle round-trips boundary tsSecOffset=0 and ttlHops=0
statusReason: body_len exceeds cap

[Killed] EqualityOperator
src/mesh-bundle.ts:141:7
     });
   }
   const bodyLen = (wire[59]! << 8) | wire[60]!;
-  if (bodyLen > MESH_BUNDLE_MAX_BODY) {
+  if (bodyLen <= MESH_BUNDLE_MAX_BODY) {
     // Cap violation -- body_len in header exceeds protocol maximum
     throw new WireCodecError('MESH_BUNDLE_TOO_LARGE', 'body_len exceeds cap', {
killedBy: encodeMeshBundle round-trips boundary tsSecOffset=0 and ttlHops=0
statusReason: body_len exceeds cap

[Survived] ObjectLiteral
src/mesh-bundle.ts:143:79
   const bodyLen = (wire[59]! << 8) | wire[60]!;
   if (bodyLen > MESH_BUNDLE_MAX_BODY) {
     // Cap violation -- body_len in header exceeds protocol maximum
-    throw new WireCodecError('MESH_BUNDLE_TOO_LARGE', 'body_len exceeds cap', {
-      bodyLen,
-      cap: MESH_BUNDLE_MAX_BODY,
-    });
+    throw new WireCodecError('MESH_BUNDLE_TOO_LARGE', 'body_len exceeds cap', {});
   }
   const expectedTotal = MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen + MESH_BUNDLE_SIG_LEN;

[Killed] ArithmeticOperator
src/mesh-bundle.ts:148:25
       cap: MESH_BUNDLE_MAX_BODY,
     });
   }
-  const expectedTotal = MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen + MESH_BUNDLE_SIG_LEN;
+  const expectedTotal = MESH_BUNDLE_HEADER_FIXED_LEN - bodyLen + MESH_BUNDLE_SIG_LEN;
   if (wire.length !== expectedTotal) {
     // Wire length mismatches declared body_len -- bundle is truncated or malformed
killedBy: encodeMeshBundle round-trips boundary tsSecOffset=0 and ttlHops=0
statusReason: bundle size mismatches header body_len

[Killed] ArithmeticOperator
src/mesh-bundle.ts:148:25
       cap: MESH_BUNDLE_MAX_BODY,
     });
   }
-  const expectedTotal = MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen + MESH_BUNDLE_SIG_LEN;
+  const expectedTotal = MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen - MESH_BUNDLE_SIG_LEN;
   if (wire.length !== expectedTotal) {
     // Wire length mismatches declared body_len -- bundle is truncated or malformed
killedBy: encodeMeshBundle round-trips boundary tsSecOffset=0 and ttlHops=0
statusReason: bundle size mismatches header body_len

[Killed] BlockStatement
src/mesh-bundle.ts:149:38
     });
   }
   const expectedTotal = MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen + MESH_BUNDLE_SIG_LEN;
-  if (wire.length !== expectedTotal) {
-    // Wire length mismatches declared body_len -- bundle is truncated or malformed
-    throw new WireCodecError('MESH_BUNDLE_TRUNCATED', 'bundle size mismatches header body_len', {
-      actual: wire.length,
-      expected: expectedTotal,
-    });
-  }
+  if (wire.length !== expectedTotal) {}
   const tsSecOffset =
     (((wire[50]! << 24) | (wire[51]! << 16) | (wire[52]! << 8) | wire[53]!) >>> 0);
killedBy: decodeMeshBundle rejects bundle where body_len ≤ cap but total wire length mismatches with MESH_BUNDLE_TRUNCATED
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/mesh-bundle.ts:149:7
     });
   }
   const expectedTotal = MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen + MESH_BUNDLE_SIG_LEN;
-  if (wire.length !== expectedTotal) {
+  if (wire.length === expectedTotal) {
     // Wire length mismatches declared body_len -- bundle is truncated or malformed
     throw new WireCodecError('MESH_BUNDLE_TRUNCATED', 'bundle size mismatches header body_len', {
killedBy: encodeMeshBundle round-trips boundary tsSecOffset=0 and ttlHops=0
statusReason: bundle size mismatches header body_len

[Survived] StringLiteral
src/mesh-bundle.ts:151:55
   const expectedTotal = MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen + MESH_BUNDLE_SIG_LEN;
   if (wire.length !== expectedTotal) {
     // Wire length mismatches declared body_len -- bundle is truncated or malformed
-    throw new WireCodecError('MESH_BUNDLE_TRUNCATED', 'bundle size mismatches header body_len', {
+    throw new WireCodecError('MESH_BUNDLE_TRUNCATED', "", {
       actual: wire.length,
       expected: expectedTotal,

[Killed] MethodExpression
src/mesh-bundle.ts:159:19
   const tsSecOffset =
     (((wire[50]! << 24) | (wire[51]! << 16) | (wire[52]! << 8) | wire[53]!) >>> 0);
   return {
-    senderPubkey: wire.slice(2, 34),
+    senderPubkey: wire,
     msgId: wire.slice(34, 50),
     tsSecOffset,
killedBy: decodeMeshBundle round-trips a valid bundle
statusReason: expected Uint8Array[ 201, 1, 170, 170, …(-40) ] to deeply equal Uint8Array[ 170, 170, 170, 170, …(-137) ]

[Killed] MethodExpression
src/mesh-bundle.ts:160:12
     (((wire[50]! << 24) | (wire[51]! << 16) | (wire[52]! << 8) | wire[53]!) >>> 0);
   return {
     senderPubkey: wire.slice(2, 34),
-    msgId: wire.slice(34, 50),
+    msgId: wire,
     tsSecOffset,
     ttlHops: wire[54]!,
killedBy: decodeMeshBundle round-trips a valid bundle
statusReason: expected Uint8Array[ 201, 1, 170, 170, …(-40) ] to deeply equal Uint8Array[ 187, 187, 187, 187, …(-170) ]

[Survived] MethodExpression
src/mesh-bundle.ts:163:20
     msgId: wire.slice(34, 50),
     tsSecOffset,
     ttlHops: wire[54]!,
-    channelIdHash: wire.slice(55, 59),
+    channelIdHash: wire,
     body: wire.slice(MESH_BUNDLE_HEADER_FIXED_LEN, MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen),
     signature: wire.slice(

[Killed] MethodExpression
src/mesh-bundle.ts:164:11
     tsSecOffset,
     ttlHops: wire[54]!,
     channelIdHash: wire.slice(55, 59),
-    body: wire.slice(MESH_BUNDLE_HEADER_FIXED_LEN, MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen),
+    body: wire,
     signature: wire.slice(
       MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen,
killedBy: decodeMeshBundle round-trips a valid bundle
statusReason: expected Uint8Array[ 201, 1, 170, 170, …(-40) ] to deeply equal Uint8Array[ 198, 0, 1, 2 ]

[Killed] ArithmeticOperator
src/mesh-bundle.ts:164:52
     tsSecOffset,
     ttlHops: wire[54]!,
     channelIdHash: wire.slice(55, 59),
-    body: wire.slice(MESH_BUNDLE_HEADER_FIXED_LEN, MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen),
+    body: wire.slice(MESH_BUNDLE_HEADER_FIXED_LEN, MESH_BUNDLE_HEADER_FIXED_LEN - bodyLen),
     signature: wire.slice(
       MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen,
killedBy: decodeMeshBundle round-trips a valid bundle
statusReason: expected Uint8Array[] to deeply equal Uint8Array[ 198, 0, 1, 2 ]

[Killed] MethodExpression
src/mesh-bundle.ts:165:16
     ttlHops: wire[54]!,
     channelIdHash: wire.slice(55, 59),
     body: wire.slice(MESH_BUNDLE_HEADER_FIXED_LEN, MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen),
-    signature: wire.slice(
-      MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen,
-      MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen + MESH_BUNDLE_SIG_LEN,
-    ),
+    signature: wire,
   };
 }
killedBy: decodeMeshBundle round-trips a valid bundle
statusReason: expected Uint8Array[ 201, 1, 170, 170, …(-40) ] to deeply equal Uint8Array[ 204, 204, 204, 204, …(-139) ]

[Killed] ArithmeticOperator
src/mesh-bundle.ts:166:7
     channelIdHash: wire.slice(55, 59),
     body: wire.slice(MESH_BUNDLE_HEADER_FIXED_LEN, MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen),
     signature: wire.slice(
-      MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen,
+      MESH_BUNDLE_HEADER_FIXED_LEN - bodyLen,
       MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen + MESH_BUNDLE_SIG_LEN,
     ),
killedBy: decodeMeshBundle round-trips a valid bundle
statusReason: expected Uint8Array[ 86, 120, 0, 4, 198, …(73) ] to deeply equal Uint8Array[ 204, 204, 204, 204, …(-139) ]

[Killed] ArithmeticOperator
src/mesh-bundle.ts:167:7
     body: wire.slice(MESH_BUNDLE_HEADER_FIXED_LEN, MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen),
     signature: wire.slice(
       MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen,
-      MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen + MESH_BUNDLE_SIG_LEN,
+      MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen - MESH_BUNDLE_SIG_LEN,
     ),
   };
killedBy: decodeMeshBundle round-trips a valid bundle
statusReason: expected Uint8Array[] to deeply equal Uint8Array[ 204, 204, 204, 204, …(-139) ]

[Killed] ArithmeticOperator
src/mesh-bundle.ts:167:7
     body: wire.slice(MESH_BUNDLE_HEADER_FIXED_LEN, MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen),
     signature: wire.slice(
       MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen,
-      MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen + MESH_BUNDLE_SIG_LEN,
+      MESH_BUNDLE_HEADER_FIXED_LEN - bodyLen + MESH_BUNDLE_SIG_LEN,
     ),
   };
killedBy: decodeMeshBundle round-trips a valid bundle
statusReason: expected Uint8Array[ 204, 204, 204, 204, …(-147) ] to deeply equal Uint8Array[ 204, 204, 204, 204, …(-139) ]

[Killed] ConditionalExpression
src/mesh-bundle.ts:180:7
  * Throws MESH_BUNDLE_TRUNCATED if the wire buffer is too short to safely slice.
  */
 export function meshBundleSignedRange(wire: Uint8Array): Uint8Array {
-  if (wire.length < MESH_BUNDLE_HEADER_FIXED_LEN + MESH_BUNDLE_SIG_LEN) {
+  if (true) {
     throw new WireCodecError('MESH_BUNDLE_TRUNCATED', 'wire too short to read body_len', {
       size: wire.length,
killedBy: decodeMeshBundle meshBundleSignedRange returns correct slice on valid wire
statusReason: wire too short to read body_len

[Killed] EqualityOperator
src/mesh-bundle.ts:180:7
  * Throws MESH_BUNDLE_TRUNCATED if the wire buffer is too short to safely slice.
  */
 export function meshBundleSignedRange(wire: Uint8Array): Uint8Array {
-  if (wire.length < MESH_BUNDLE_HEADER_FIXED_LEN + MESH_BUNDLE_SIG_LEN) {
+  if (wire.length >= MESH_BUNDLE_HEADER_FIXED_LEN + MESH_BUNDLE_SIG_LEN) {
     throw new WireCodecError('MESH_BUNDLE_TRUNCATED', 'wire too short to read body_len', {
       size: wire.length,
killedBy: decodeMeshBundle meshBundleSignedRange returns correct slice on valid wire
statusReason: wire too short to read body_len

[Survived] StringLiteral
src/mesh-bundle.ts:181:55
  */
 export function meshBundleSignedRange(wire: Uint8Array): Uint8Array {
   if (wire.length < MESH_BUNDLE_HEADER_FIXED_LEN + MESH_BUNDLE_SIG_LEN) {
-    throw new WireCodecError('MESH_BUNDLE_TRUNCATED', 'wire too short to read body_len', {
+    throw new WireCodecError('MESH_BUNDLE_TRUNCATED', "", {
       size: wire.length,
       min: MESH_BUNDLE_HEADER_FIXED_LEN + MESH_BUNDLE_SIG_LEN,

[Killed] ConditionalExpression
src/mesh-bundle.ts:187:7
     });
   }
   const bodyLen = (wire[59]! << 8) | wire[60]!;
-  if (bodyLen + MESH_BUNDLE_HEADER_FIXED_LEN > wire.length) {
+  if (false) {
     throw new WireCodecError('MESH_BUNDLE_TRUNCATED', 'wire too short for declared body_len', {
       bodyLen,
killedBy: decodeMeshBundle meshBundleSignedRange throws MESH_BUNDLE_TRUNCATED when bodyLen+61 > wire.length
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/mesh-bundle.ts:187:7
     });
   }
   const bodyLen = (wire[59]! << 8) | wire[60]!;
-  if (bodyLen + MESH_BUNDLE_HEADER_FIXED_LEN > wire.length) {
+  if (bodyLen + MESH_BUNDLE_HEADER_FIXED_LEN <= wire.length) {
     throw new WireCodecError('MESH_BUNDLE_TRUNCATED', 'wire too short for declared body_len', {
       bodyLen,
killedBy: decodeMeshBundle meshBundleSignedRange throws MESH_BUNDLE_TRUNCATED when bodyLen+61 > wire.length
statusReason: expected function to throw an error, but it didn't

[Survived] ObjectLiteral
src/mesh-bundle.ts:188:95
   }
   const bodyLen = (wire[59]! << 8) | wire[60]!;
   if (bodyLen + MESH_BUNDLE_HEADER_FIXED_LEN > wire.length) {
-    throw new WireCodecError('MESH_BUNDLE_TRUNCATED', 'wire too short for declared body_len', {
-      bodyLen,
-      required: bodyLen + MESH_BUNDLE_HEADER_FIXED_LEN,
-      actual: wire.length,
-    });
+    throw new WireCodecError('MESH_BUNDLE_TRUNCATED', 'wire too short for declared body_len', {});
   }
   return wire.slice(0, MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen);

[Survived] ArithmeticOperator
src/mesh-bundle.ts:190:17
   if (bodyLen + MESH_BUNDLE_HEADER_FIXED_LEN > wire.length) {
     throw new WireCodecError('MESH_BUNDLE_TRUNCATED', 'wire too short for declared body_len', {
       bodyLen,
-      required: bodyLen + MESH_BUNDLE_HEADER_FIXED_LEN,
+      required: bodyLen - MESH_BUNDLE_HEADER_FIXED_LEN,
       actual: wire.length,
     });

[Killed] ArithmeticOperator
src/mesh-bundle.ts:194:24
       actual: wire.length,
     });
   }
-  return wire.slice(0, MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen);
+  return wire.slice(0, MESH_BUNDLE_HEADER_FIXED_LEN - bodyLen);
 }
 
killedBy: decodeMeshBundle meshBundleSignedRange returns correct slice on valid wire
statusReason: expected 59 to be 63 // Object.is equality

[Killed] MethodExpression
src/mesh-bundle.ts:194:10
       actual: wire.length,
     });
   }
-  return wire.slice(0, MESH_BUNDLE_HEADER_FIXED_LEN + bodyLen);
+  return wire;
 }
 
killedBy: decodeMeshBundle meshBundleSignedRange returns correct slice on valid wire
statusReason: expected 127 to be 63 // Object.is equality
