[Killed] ConditionalExpression
src/envelope-v2.ts:228:36
 	if (!canEncodeAsV2(value)) return false;
 	if (!Number.isInteger(peerIndex) || peerIndex < 0 || peerIndex > 0xff) return false;
 	const o = value as Record<string, unknown>;
-	if (typeof o.from !== "string" || o.from.length === 0) return false;
+	if (typeof o.from !== "string" || false) return false;
 	return true;
 }
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) encoder falls back to v2 when from is empty string
statusReason: expected 202 to be 200 // Object.is equality

[Killed] LogicalOperator
src/envelope-v2.ts:248:6
 	v1: Record<string, unknown>,
 	peerIndex: number,
 ): Record<string, unknown> {
-	if (!Number.isInteger(peerIndex) || peerIndex < 0 || peerIndex > 0xff) {
+	if ((!Number.isInteger(peerIndex) || peerIndex < 0) && peerIndex > 0xff) {
 		throw new Error(`wire-envelope-v3: peerIndex must be uint8 (0..255), got ${peerIndex}`);
 	}
killedBy: Phase 2.F.B — toV3/fromV3 direct unit tests toV3 defensive checks throws on peerIndex=-1 (direct call, bypasses canEncodeAsV3)
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/envelope-v2.ts:248:73
 	v1: Record<string, unknown>,
 	peerIndex: number,
 ): Record<string, unknown> {
-	if (!Number.isInteger(peerIndex) || peerIndex < 0 || peerIndex > 0xff) {
-		throw new Error(`wire-envelope-v3: peerIndex must be uint8 (0..255), got ${peerIndex}`);
-	}
+	if (!Number.isInteger(peerIndex) || peerIndex < 0 || peerIndex > 0xff) {}
 	const kByte = KIND_TO_BYTE[v1.kind as string];
 	if (kByte === undefined) {
killedBy: Phase 2.F.B — toV3/fromV3 direct unit tests toV3 defensive checks throws on peerIndex=-1 (direct call, bypasses canEncodeAsV3)
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/envelope-v2.ts:252:27
 		throw new Error(`wire-envelope-v3: peerIndex must be uint8 (0..255), got ${peerIndex}`);
 	}
 	const kByte = KIND_TO_BYTE[v1.kind as string];
-	if (kByte === undefined) {
-		throw new Error(`wire-envelope-v3: cannot encode kind "${String(v1.kind)}" — not a known wire kind`);
-	}
+	if (kByte === undefined) {}
 	const idBytes = uuidToBytes(v1.id as string)!;
 	const out: Record<string, unknown> = { ...v1 };
killedBy: Phase 2.F.B — toV3/fromV3 direct unit tests toV3 defensive checks throws on unknown kind (direct call, bypasses canEncodeAsV3)
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/envelope-v2.ts:292:81
 		throw new Error("wire-envelope-v3: id must be 16-byte Uint8Array");
 	}
 	const tsDelta = v3.ts;
-	if (typeof tsDelta !== "number" || !Number.isFinite(tsDelta) || tsDelta < 0 || tsDelta > 0xffff_ffff) {
+	if (typeof tsDelta !== "number" || !Number.isFinite(tsDelta) || tsDelta < 0 || tsDelta >= 0xffff_ffff) {
 		throw new Error("wire-envelope-v3: ts out of uint32 window");
 	}
killedBy: Phase 2.F.B — envelope-v3 (0xCA magic, peer-index compaction) fromV3 accepts forged frame with tsDelta=0xffffffff (max uint32 boundary)
statusReason: wire-envelope-v3: ts out of uint32 window

[Killed] ConditionalExpression
src/envelope-v2.ts:292:66
 		throw new Error("wire-envelope-v3: id must be 16-byte Uint8Array");
 	}
 	const tsDelta = v3.ts;
-	if (typeof tsDelta !== "number" || !Number.isFinite(tsDelta) || tsDelta < 0 || tsDelta > 0xffff_ffff) {
+	if (typeof tsDelta !== "number" || !Number.isFinite(tsDelta) || false || tsDelta > 0xffff_ffff) {
 		throw new Error("wire-envelope-v3: ts out of uint32 window");
 	}
killedBy: Phase 2.F.B — toV3/fromV3 direct unit tests fromV3 defensive checks throws on ts=-1 (negative, direct call)
statusReason: expected [Function] to throw an error
